Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# exportMyCvPdf
source: Export my CV in PDF
es: Exportar mi CV en PDF
fr: Exporter mon CV en PDF

source: Generating...
es: Generando...
fr: Génération...

source: Error downloading CV
es: Error al descargar CV
fr: Erreur lors du téléchargement du CV

source: Add experience
es: Agregar experiencia
fr: Ajouter une expérience

source: Check with AI
es: Verificar con IA
fr: Vérifier avec l'IA

source: Setup Profile
es: Configurar Perfil
fr: Configurer le Profil

# exportCvPdf
source: Export my CV in PDF
es: Exportar mi CV en PDF
fr: Exporter le CV en PDF

# addPhoneNumber
source: Add your phone number
es: Agrega tu número de teléfono
fr: Ajouter un numéro de téléphone

# addLinkedIn
source: Add your LinkedIn
es: Agrega tu LinkedIn
fr: Ajouter LinkedIn

source: Verify email
es: Verificar correo electrónico
fr: Vérifier l'e-mail

# emailSentTo
source: An email has been sent to:
es: Se ha enviado un correo electrónico a:
fr: Un e-mail a été envoyé à :

# clickLinkToVerify
source: Click the link in the email to verify your account.
es: Haz clic en el enlace del correo electrónico para verificar tu cuenta.
fr: Cliquez sur le lien dans l'e-mail pour vérifier votre compte.

source: Sending...
es: Enviando...
fr: Envoi en cours...

# waitSeconds
source: Wait {seconds}s
es: Espera {seconds}s
fr: Attendre {seconds}s

source: Resend verification email
es: Reenviar correo de verificación
fr: Renvoyer l'e-mail de vérification

source: Back to login
es: Volver al inicio de sesión
fr: Retour à la connexion

# impossibleToSendEmail
source: Impossible to send email : {error}
es: Imposible enviar correo electrónico : {error}
fr: Impossible d'envoyer l'e-mail : {error}

source: Reset password
es: Restablecer contraseña
fr: Réinitialiser le mot de passe

# setNewPassword
source: Set a new password
es: Establecer una nueva contraseña
fr: Définir un nouveau mot de passe

# chooseStrongPassword
source: Choose a strong password you haven't used before.
es: Elige una contraseña fuerte que no hayas usado antes.
fr: Choisissez un mot de passe fort que vous n'avez jamais utilisé auparavant.

source: New password
es: Nueva contraseña
fr: Nouveau mot de passe

source: Password Changed
es: Contraseña Cambiada
fr: Mot de Passe Modifié

# passwordUpdatedMessage
source: Your password has been updated. You can now log in.
es: Tu contraseña ha sido actualizada. Ahora puedes iniciar sesión.
fr: Votre mot de passe a été mis à jour. Vous pouvez maintenant vous connecter.

# failedWithError
source: Failed: {error}
es: Falló: {error}
fr: Échec : {error}

source: Reset your password
es: Restablece tu contraseña
fr: Réinitialisez votre mot de passe

# enterEmailForReset
source: Enter your email address and we'll send you a link to reset your password.
es: Ingresa tu dirección de correo electrónico y te enviaremos un enlace para restablecer tu contraseña.
fr: Entrez votre adresse e-mail et nous vous enverrons un lien pour réinitialiser votre mot de passe.

source: Send reset email
es: Enviar correo de restablecimiento
fr: Envoyer l'e-mail de réinitialisation

# passwordResetTitle
source: Password Reset
es: Restablecimiento de Contraseña
fr: Réinitialisation du Mot de Passe

# passwordResetMessage
source: If this email exists, you will receive a password reset link.
es: Si este correo electrónico existe, recibirás un enlace para restablecer tu contraseña.
fr: Si cet e-mail existe, vous recevrez un lien de réinitialisation du mot de passe.

source: Email Verification
es: Verificación de Email
fr: Vérification d'E-mail

source: Email verified!
es: ¡Email verificado!
fr: E-mail vérifié !

source: Verification failed
es: Verificación fallida
fr: Vérification échouée

# missingVerificationToken
source: Missing verification token in URL.
es: Falta el token de verificación en la URL.
fr: Token de vérification manquant dans l'URL.

source: Date unknown
es: Fecha desconocida
fr: Date inconnue

source: Ongoing
es: En curso
fr: En cours

source: SolidCV Assistant
es: Asistente SolidCV
fr: Assistant SolidCV

source: Online
es: En línea
fr: En ligne

# setupIntroduction
source: I'm here to help you set up your account and get the most out of our platform. This will only take a few minutes.
es: Estoy aquí para ayudarte a configurar tu cuenta y aprovechar al máximo nuestra plataforma. Esto solo tomará unos minutos.
fr: Je suis là pour vous aider à configurer votre compte et tirer le meilleur parti de notre plateforme. Cela ne prendra que quelques minutes.

# walletSetupInfo
source: We'll configure your blockchain wallet and help you upload your CV to get started.
es: Configuraremos tu cartera blockchain y te ayudaremos a subir tu CV para comenzar.
fr: Nous configurerons votre portefeuille blockchain et vous aiderons à télécharger votre CV pour commencer.

source: Blockchain Wallet Setup
es: Configuración de Cartera Blockchain
fr: Configuration du Portefeuille Blockchain

source: What is this for?
es: ¿Para qué es esto?
fr: À quoi cela sert-il ?

# walletPurposeExplanation
source: Your wallet serves only as a secure digital identifier to ensure the traceability and authenticity of your experiences, certificates, and diplomas. No cryptocurrencies are involved, and this is not a financial tool. Think of it as a secure digital signature that proves your achievements are genuine.
es: Tu cartera sirve solo como un identificador digital seguro para garantizar la trazabilidad y autenticidad de tus experiencias, certificados y diplomas. No involucra criptomonedas y no es una herramienta financiera. Piénsalo como una firma digital segura que demuestra que tus logros son genuinos.
fr: Votre portefeuille sert uniquement d'identifiant numérique sécurisé pour assurer la traçabilité et l'authenticité de vos expériences, certificats et diplômes. Aucune cryptomonnaie n'est impliquée, et ce n'est pas un outil financier. Pensez-y comme une signature numérique sécurisée qui prouve que vos réalisations sont authentiques.

# doYouHaveWallet
source: Do you already have a blockchain wallet address?
es: ¿Ya tienes una dirección de cartera blockchain?
fr: Avez-vous déjà une adresse de portefeuille blockchain ?

# setSecurePassword
source: Please set a secure password to encrypt your wallet:
es: Por favor, establece una contraseña segura para encriptar tu cartera:
fr: Veuillez définir un mot de passe sécurisé pour chiffrer votre portefeuille :

source: Yes, I have one
es: Sí, tengo una
fr: Oui, j'en ai un

source: No, I don't
es: No, no tengo
fr: Non, je n'en ai pas

# continueText
source: Continue
es: Continuar
fr: Continuer

source: Back
es: Atrás
fr: Retour

source: Create Wallet
es: Crear Cartera
fr: Créer un Portefeuille

source: Loading your skills...
es: Cargando tus habilidades...
fr: Chargement de vos compétences...

source: Error loading skills
es: Error al cargar habilidades
fr: Erreur lors du chargement des compétences

# continueWithoutSkills
source: Continue without skills for now
es: Continuar sin habilidades por ahora
fr: Continuer sans compétences pour l'instant

source: Review Your Skills
es: Revisa Tus Habilidades
fr: Examinez Vos Compétences

# skillsCountMessage
source: You have {count} skill{plural}. You can remove any that aren't relevant.
es: Tienes {count} habilidad{plural}. Puedes eliminar las que no sean relevantes.
fr: Vous avez {count} compétence{plural}. Vous pouvez supprimer celles qui ne sont pas pertinentes.

source: No skills found
es: No se encontraron habilidades
fr: Aucune compétence trouvée

# continueCompleteProfile
source: Continue to complete your profile setup
es: Continúa para completar la configuración de tu perfil
fr: Continuez pour terminer la configuration de votre profil

# tapToRemoveSkills
source: Tap × to remove skills you don't want to include
es: Toca × para eliminar habilidades que no quieras incluir
fr: Appuyez sur × pour supprimer les compétences que vous ne voulez pas inclure

# skillsIncluded
source: {count} skills will be included in your profile
es: {count} habilidades serán incluidas en tu perfil
fr: {count} compétences seront incluses dans votre profil

# completeProfileSetupButton
source: Complete Profile Setup
es: Completar Configuración del Perfil
fr: Terminer la Configuration du Profil

source: Loading your experiences...
es: Cargando tus experiencias...
fr: Chargement de vos expériences...

source: Error loading experiences
es: Error al cargar experiencias
fr: Erreur lors du chargement des expériences

# canStillAddExperiencesManually
source: You can still add experiences manually
es: Aún puedes agregar experiencias manualmente
fr: Vous pouvez toujours ajouter des expériences manuellement

source: Review Your Experience
es: Revisa Tu Experiencia
fr: Examinez Votre Expérience

source: No experience found
es: No se encontraron experiencias
fr: Aucune expérience trouvée

source: Continue to Certificates
es: Continuar a Certificados
fr: Continuer vers les Certificats

source: Edit Experience
es: Editar Experiencia
fr: Modifier l'Expérience

# updateWorkExperienceDetails
source: Update your work experience details
es: Actualiza los detalles de tu experiencia laboral
fr: Mettez à jour les détails de votre expérience professionnelle

# jobTitleRequired
source: Job Title *
es: Título del Trabajo *
fr: Titre du Poste *

# jobTitleHint
source: e.g. Senior Flutter Developer
es: ej. Desarrollador Senior Flutter
fr: ex. Développeur Flutter Senior

# companyRequired
source: Company *
es: Empresa *
fr: Entreprise *

# companyHint
source: e.g., Google, Microsoft, Apple
es: ej., Google, Microsoft, Apple
fr: ex., Google, Microsoft, Apple

# startDateRequired
source: Start Date *
es: Fecha de Inicio *
fr: Date de Début *

# endDateRequired
source: End Date *
es: Fecha de Fin *
fr: Date de Fin *

# currentlyWorkHere
source: I currently work here
es: Actualmente trabajo aquí
fr: Je travaille actuellement ici

# currentPositionHint
source: Check this if this is your current position
es: Marca esto si esta es tu posición actual
fr: Cochez ceci si c'est votre poste actuel

source: Job Description
es: Descripción del Trabajo
fr: Description du Poste

# jobDescriptionHint
source: Describe the role, responsibilities, and what you're looking for...
es: Describe el puesto, responsabilidades y lo que buscas...
fr: Décrivez le rôle, les responsabilités et ce que vous recherchez...

source: Writing Tips
es: Consejos de Escritura
fr: Conseils de Rédaction

# experienceTipsContent
source: • Use action verbs (developed, managed, implemented) • Include quantifiable achievements • Focus on results and impact
es: • Usa verbos de acción (desarrolló, gestionó, implementó) • Incluye logros cuantificables • Enfócate en resultados e impacto
fr: • Utilisez des verbes d'action (développé, géré, implémenté) • Incluez des réalisations quantifiables • Concentrez-vous sur les résultats et l'impact

source: Edit Details
es: Editar Detalles
fr: Modifier les Détails

source: Present
es: Presente
fr: Présent

source: Position Title
es: Título del Puesto
fr: Titre du Poste

source: Save Changes
es: Guardar Cambios
fr: Enregistrer les Modifications

# fillAllRequiredFields
source: Please fill in all required fields
es: Por favor completa todos los campos obligatorios
fr: Veuillez remplir tous les champs obligatoires

# experienceCountSingular
source: You have 1 work experience. Please review and edit it as needed.
es: Tienes 1 experiencia laboral. Por favor revísala y edítala según sea necesario.
fr: Vous avez 1 expérience professionnelle. Veuillez la réviser et la modifier selon vos besoins.

# experienceCountPlural
source: You have {count} work experiences. Please review and edit them as needed.
es: Tienes {count} experiencias laborales. Por favor revísalas y edítalas según sea necesario.
fr: Vous avez {count} expériences professionnelles. Veuillez les réviser et les modifier selon vos besoins.

source: CV Upload (Optional)
es: Subida de CV (Opcional)
fr: Téléchargement de CV (Optionnel)

# cvUploadDescription
source: Upload your CV and I'll extract your experience, certificates, and skills automatically!
es: ¡Sube tu CV y extraeré tu experiencia, certificados y habilidades automáticamente!
fr: Téléchargez votre CV et j'extrairai automatiquement votre expérience, certificats et compétences !

# clickToUploadCV
source: Click to upload your CV
es: Haz clic para subir tu CV
fr: Cliquez pour télécharger votre CV

# pdfOnlyAutoExtract
source: PDF files only • We'll extract your data automatically
es: Solo archivos PDF • Extraeremos tus datos automáticamente
fr: Fichiers PDF uniquement • Nous extrairons vos données automatiquement

source: Uploading your CV...
es: Subiendo tu CV...
fr: Téléchargement de votre CV...

# extractingCVData
source: Extracting your experience, certificates, and skills...
es: Extrayendo tu experiencia, certificados y habilidades...
fr: Extraction de votre expérience, certificats et compétences...

# extractionMayTakeMoments
source: This may take a few moments
es: Esto puede tomar unos momentos
fr: Cela peut prendre quelques instants

source: CV Processed Successfully!
es: ¡CV Procesado Exitosamente!
fr: CV Traité avec Succès !

source: Skip for now
es: Omitir por ahora
fr: Ignorer pour l'instant

source: Review & Edit Data
es: Revisar y Editar Datos
fr: Réviser et Modifier les Données

source: Error uploading CV:
es: Error al subir CV:
fr: Erreur lors du téléchargement du CV :

source: CV data extracted successfully!
es: ¡Datos del CV extraídos exitosamente!
fr: Données du CV extraites avec succès !

source: Error extracting CV data:
es: Error al extraer datos del CV:
fr: Erreur lors de l'extraction des données du CV :

# accountSetupComplete
source: Your account is now set up and ready to use. Choose where you'd like to start your journey:
es: Tu cuenta ya está configurada y lista para usar. Elige dónde te gustaría comenzar tu viaje:
fr: Votre compte est maintenant configuré et prêt à être utilisé. Choisissez où vous aimeriez commencer votre voyage :

source: Go to Home Page
es: Ir a la Página Principal
fr: Aller à la Page d'Accueil

source: View My CV
es: Ver Mi CV
fr: Voir Mon CV

source: Create an organization
es: Crear una organización
fr: Créer une organisation

# navigationMenuTip
source: Tip: You can always access these pages from the navigation menu!
es: Consejo: ¡Siempre puedes acceder a estas páginas desde el menú de navegación!
fr: Astuce : Vous pouvez toujours accéder à ces pages depuis le menu de navigation !

source: Loading your certificates...
es: Cargando tus certificados...
fr: Chargement de vos certificats...

source: Error loading certificates
es: Error al cargar certificados
fr: Erreur lors du chargement des certificats

# canStillAddCertificatesManually
source: You can still add certificates manually
es: Aún puedes agregar certificados manualmente
fr: Vous pouvez toujours ajouter des certificats manuellement

source: Review Your Certificates
es: Revisa Tus Certificados
fr: Examinez Vos Certificats

source: No certificates found
es: No se encontraron certificados
fr: Aucun certificat trouvé

# addCertificationsManually
source: Add your professional certifications manually
es: Agrega tus certificaciones profesionales manualmente
fr: Ajoutez vos certifications professionnelles manuellement

source: Continue to Skills
es: Continuar a Habilidades
fr: Continuer vers les Compétences

# certificateTitle
source: Title
es: Título
fr: Titre

# issuedBy
source: Issued by {issuer}
es: Emitido por {issuer}
fr: Émis par {issuer}

source: Issued:
es: Emitido:
fr: Émis :

source: Edit Certificate
es: Editar Certificado
fr: Modifier le Certificat

# updateCertificationDetails
source: Update your certification details
es: Actualiza los detalles de tu certificación
fr: Mettez à jour les détails de votre certification

# certificateNameRequired
source: Certificate Name *
es: Nombre del Certificado *
fr: Nom du Certificat *

# certificateNameHint
source: e.g., AWS Certified Developer
es: ej., AWS Certified Developer
fr: ex., AWS Certified Developer

# issuingOrganizationRequired
source: Issuing Organization *
es: Organización Emisora *
fr: Organisation Émettrice *

# issuingOrganizationHint
source: e.g., Amazon Web Services
es: ej., Amazon Web Services
fr: ex., Amazon Web Services

# issueDateRequired
source: Issue Date *
es: Fecha de Emisión *
fr: Date d'Émission *

# certificateDescription
source: Description
es: Descripción

# certificateDescriptionHint
source: Brief description of skills and knowledge covered...
es: Breve descripción de habilidades y conocimientos cubiertos...
fr: Brève description des compétences et connaissances couvertes...

# certificateCountSingular
source: You have 1 certificate. Please review and edit it as needed.
es: Tienes 1 certificado. Por favor revísalo y edítalo según sea necesario.
fr: Vous avez 1 certificat. Veuillez le réviser et le modifier selon vos besoins.

# certificateCountPlural
source: You have {count} certificates. Please review and edit them as needed.
es: Tienes {count} certificados. Por favor revísalos y edítalos según sea necesario.
fr: Vous avez {count} certificats. Veuillez les réviser et les modifier selon vos besoins.

source: AI Skill Test
es: Prueba de Habilidades IA
fr: Test de Compétences IA

# whyTestSkillsTitle
source: Why do we test your skills?
es: ¿Por qué evaluamos tus habilidades?
fr: Pourquoi testons-nous vos compétences ?

# whyTestSkillsExplanation
source: We use this data to provide you with personalized feedback about your skills, help recruiters understand how well applicants match their job offers, and eventually provide you with tailored career advice to advance your professional growth. You can always do it or continue to answer questions on your CV page
es: Utilizamos estos datos para brindarte retroalimentación personalizada sobre tus habilidades, ayudar a los reclutadores a entender qué tan bien los candidatos coinciden con sus ofertas de trabajo, y eventualmente proporcionarte consejos de carrera personalizados para avanzar tu crecimiento profesional. Siempre puedes hacerlo o continuar respondiendo preguntas en tu página de CV
fr: Nous utilisons ces données pour vous fournir des commentaires personnalisés sur vos compétences, aider les recruteurs à comprendre dans quelle mesure les candidats correspondent à leurs offres d'emploi, et éventuellement vous fournir des conseils de carrière sur mesure pour faire progresser votre croissance professionnelle. Vous pouvez toujours le faire ou continuer à répondre aux questions sur votre page CV

# testingSkill
source: Testing: {skillName}
es: Evaluando: {skillName}
fr: Test en cours : {skillName}

# answerQuestionsPrompt
source: Answer questions to validate your skill level
es: Responde preguntas para validar tu nivel de habilidad
fr: Répondez aux questions pour valider votre niveau de compétence

source: Conversation History
es: Historial de Conversación
fr: Historique des Conversations

# messagesCount
source: {count} messages
es: {count} mensajes

# aiPreparingQuestion
source: AI is preparing a question...
es: La IA está preparando una pregunta...
fr: L'IA prépare une question...

# speechListening
source: Listening... ({confidence}% confidence)
es: Escuchando... ({confidence}% confianza)
fr: Écoute... ({confidence}% de confiance)

# limitedSpeechSupport
source: Limited speech support on mobile browsers
es: Soporte de voz limitado en navegadores móviles
fr: Support vocal limité sur les navigateurs mobiles

# speechNotAvailable
source: Speech recognition not available
es: Reconocimiento de voz no disponible
fr: Reconnaissance vocale non disponible

# speechMobileBrowserTip
source: For best speech experience, use a desktop browser or type your answers below.
es: Para la mejor experiencia de voz, usa un navegador de escritorio o escribe tus respuestas abajo.
fr: Pour une meilleure expérience vocale, utilisez un navigateur de bureau ou tapez vos réponses ci-dessous.

# tapToSpeakWeb
source: Tap to speak (Web browser - limited functionality)
es: Toca para hablar (Navegador web - funcionalidad limitada)
fr: Appuyez pour parler (Navigateur web - fonctionnalité limitée)

source: Tap to speak
es: Toca para hablar
fr: Appuyez pour parler

# inputHintMobile
source: Type your answer or try the mic button (limited on mobile)... Press Ctrl+Enter to submit
es: Escribe tu respuesta o prueba el botón del micrófono (limitado en móviles)... Presiona Ctrl+Enter para enviar
fr: Tapez votre réponse ou essayez le bouton micro (limité sur mobile)... Appuyez sur Ctrl+Entrée pour envoyer

# inputHintSpeech
source: Type or tap mic to speak... Press Ctrl+Enter to submit
es: Escribe o toca el micrófono para hablar... Presiona Ctrl+Enter para enviar
fr: Tapez ou appuyez sur le micro pour parler... Appuyez sur Ctrl+Entrée pour envoyer

# inputHintDefault
source: Type your answer... Press Ctrl+Enter to submit
es: Escribe tu respuesta... Presiona Ctrl+Enter para enviar
fr: Tapez votre réponse... Appuyez sur Ctrl+Entrée pour envoyer

# submitAnswerTooltip
source: Submit answer (Ctrl+Enter)
es: Enviar respuesta (Ctrl+Enter)
fr: Envoyer la réponse (Ctrl+Entrée)

source: Clear
es: Limpiar
fr: Effacer

source: Submit
es: Enviar
fr: Envoyer

source: Start AI Test
es: Iniciar Prueba IA
fr: Démarrer le Test IA

source: Complete Test
es: Completar Prueba
fr: Terminer le Test

source: Skip
es: Saltar
fr: Passer

source: Skill Validation Complete! 🎉
es: ¡Validación de Habilidades Completa! 🎉
fr: Validation des Compétences Terminée ! 🎉

source: Validation Summary
es: Resumen de Validación
fr: Résumé de Validation

source: Validated
es: Validadas
fr: Validées

source: Skipped
es: Saltadas
fr: Passées

source: Complete Setup
es: Completar Configuración
fr: Terminer la Configuration

source: No question available
es: No hay pregunta disponible
fr: Aucune question disponible

# questionGenerationError
source: Sorry, I couldn't generate a question for this skill. Let's move to the next one.
es: Lo siento, no pude generar una pregunta para esta habilidad. Pasemos a la siguiente.
fr: Désolé, je n'ai pas pu générer une question pour cette compétence. Passons à la suivante.

# skillTestComplete
source: Great! You've completed the test for this skill. You can continue to the next skill or review your answers.
es: ¡Excelente! Has completado la prueba para esta habilidad. Puedes continuar a la siguiente habilidad o revisar tus respuestas.
fr: Excellent ! Vous avez terminé le test pour cette compétence. Vous pouvez continuer vers la compétence suivante ou réviser vos réponses.

# answerProcessingError
source: There was an issue processing your answer. Let's continue.
es: Hubo un problema procesando tu respuesta. Continuemos.
fr: Il y a eu un problème lors du traitement de votre réponse. Continuons.

# movingToNextSkill
source: --- Moving to next skill: {skillName} ---
es: --- Pasando a la siguiente habilidad: {skillName} ---
fr: --- Passage à la compétence suivante : {skillName} ---

# skillTestCompleted
source: Completed
es: Completado
fr: Terminé

# createCertificateTitle
source: Create a Certificate
es: Crear un Certificado
fr: Créer un Certificat

# searchUserCardTitle
source: Search for a user to assign a certificate
es: Buscar un usuario para asignar un certificado
fr: Rechercher un utilisateur pour attribuer un certificat

# searchUserCardSubtitle
source: Start typing a name or email.
es: Comienza escribiendo un nombre o email.
fr: Commencez à taper un nom ou un email.

# createCertificate
source: Create a Certificate
es: Crear un Certificado
fr: Créer un Certificat

# certificateTitleRequired
source: Please enter a certificate title
es: Por favor ingrese un título de certificado
fr: Veuillez saisir un titre de certificat

# certificateTypeRequired
source: Please enter a certificate type
es: Por favor ingrese un tipo de certificado
fr: Veuillez saisir un type de certificat

# certificateGrade
source: Grade
es: Calificación
fr: Note
