Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Add New Administrator
es: Agregar Nuevo Administrador
fr: Ajouter un Nouvel Administrateur

# searchUsersPlaceholder
source: Search users by name or email...
es: Buscar usuarios por nombre o correo...
fr: Rechercher des utilisateurs par nom ou courriel...

# searchResults
source: Search Results ({count})
es: Resultados de Búsqueda ({count})
fr: Résultats de Recherche ({count})

source: Add as Administrator
es: Agregar como Administrador
fr: Ajouter comme Administrateur

source: Already Administrator
es: Ya es Administrador
fr: Déjà Administrateur

source: Employees
es: Empleados
fr: Employés

source: + Add Work Experience to User
es: + Agregar Experiencia Laboral al Usuario
fr: + Ajouter une Expérience Professionnelle à l'Utilisateur

source: Admin Area
es: Área de Administración
fr: Zone d'Administration

source: Redirecting to setup...
es: Redirigiendo a configuración...
fr: Redirection vers la configuration...

source: Welcome Back! 🎉
es: ¡Bienvenido de Vuelta! 🎉
fr: Bon Retour ! 🎉

# walletConnected
source: Your Base Blockchain Wallet is Connected
es: Tu Billetera de Base Blockchain Está Conectada
fr: Votre Portefeuille Base Blockchain est Connecté

# walletReadyDescription
source: Your wallet is connected and ready to use. Start exploring all the amazing features SolidCV has to offer!
es: Tu billetera está conectada y lista para usar. ¡Comienza a explorar todas las características increíbles que SolidCV tiene para ofrecer!
fr: Votre portefeuille est connecté et prêt à utiliser. Commencez à explorer toutes les fonctionnalités incroyables que SolidCV a à offrir !

source: Your Wallet Address
es: Tu Dirección de Billetera
fr: Votre Adresse de Portefeuille

source: Copy Address
es: Copiar Dirección
fr: Copier l'Adresse

# addressCopied
source: Address copied to clipboard!
es: ¡Dirección copiada al portapapeles!
fr: Adresse copiée dans le presse-papiers !

source: Connect Wallet
es: Conectar Billetera
fr: Connecter le Portefeuille

# connectExistingWallet
source: Connect an Existing Wallet
es: Conectar una Billetera Existente
fr: Connecter un Portefeuille Existant

# connectExistingWalletDescription
source: Already have a Base Blockchain wallet? Enter your wallet address below to connect it to your SolidCV account.
es: ¿Ya tienes una billetera de Base Blockchain? Ingresa tu dirección de billetera a continuación para conectarla a tu cuenta de SolidCV.
fr: Vous avez déjà un portefeuille Base Blockchain ? Entrez votre adresse de portefeuille ci-dessous pour le connecter à votre compte SolidCV.

# createNewWallet
source: Create a New Wallet
es: Crear una Nueva Billetera
fr: Créer un Nouveau Portefeuille

# createNewWalletTitle
source: Create a New Wallet
es: Crear una Nueva Billetera
fr: Créer un Nouveau Portefeuille

# createNewWalletDescription
source: SolidCV can generate a new secure Base Blockchain wallet for you. Choose a strong password to protect your private key.
es: SolidCV puede generar una nueva billetera segura de Base Blockchain para ti. Elige una contraseña fuerte para proteger tu clave privada.
fr: SolidCV peut générer un nouveau portefeuille Base Blockchain sécurisé pour vous. Choisissez un mot de passe fort pour protéger votre clé privée.

# passwordToEncryptKey
source: Password (to encrypt the private key, make sure to remember it, there is no way to recover it)
es: Contraseña (para cifrar la clave privada, asegúrate de recordarla, no hay forma de recuperarla)
fr: Mot de passe (pour chiffrer la clé privée, assurez-vous de vous en souvenir, il n'y a aucun moyen de la récupérer)

# passwordEncryptionWarning
source: This password will encrypt your private key. Keep it safe, it is unrecoverable.
es: Esta contraseña cifrará tu clave privada. Manténla segura, es irrecuperable.
fr: Ce mot de passe chiffrera votre clé privée. Gardez-le en sécurité, il est irrécupérable.

# completeProfileSetup
source: Complete Your Profile Setup
es: Completa la Configuración de tu Perfil
fr: Terminer la Configuration de Votre Profil

# profileSetupDescription
source: Our smart assistant will guide you through setting up your profile, uploading your CV, and optimizing your account for the best experience. You can start this process even without a wallet.
es: Nuestro asistente inteligente te guiará a través de la configuración de tu perfil, la carga de tu CV y la optimización de tu cuenta para la mejor experiencia. Puedes comenzar este proceso incluso sin una billetera.
fr: Notre assistant intelligent vous guidera à travers la configuration de votre profil, le téléchargement de votre CV et l'optimisation de votre compte pour la meilleure expérience. Vous pouvez commencer ce processus même sans portefeuille.

source: Start Setup Assistant
es: Iniciar Asistente de Configuración
fr: Démarrer l'Assistant de Configuration

source: Wallet Created Successfully! 🎉
es: ¡Billetera Creada Exitosamente! 🎉
fr: Portefeuille Créé avec Succès ! 🎉

# newWalletReady
source: Your new wallet is ready to use
es: Tu nueva billetera está lista para usar
fr: Votre nouveau portefeuille est prêt à utiliser

source: Public Address
es: Dirección Pública
fr: Adresse Publique

source: Private Key
es: Clave Privada
fr: Clé Privée

# savePrivateKeyWarning
source: Make sure to save the private key in a safe place. It will not be shown again and you can't recover it if lost.
es: Asegúrate de guardar la clave privada en un lugar seguro. No se mostrará de nuevo y no puedes recuperarla si se pierde.
fr: Assurez-vous de sauvegarder la clé privée dans un endroit sûr. Elle ne sera plus affichée et vous ne pouvez pas la récupérer si elle est perdue.

# continueButton
source: Continue
es: Continuar
fr: Continuer

# copy
source: Copy {label}
es: Copiar {label}
fr: Copier {label}

source: Find Job Opportunities
es: Encontrar Oportunidades de Trabajo
fr: Trouver des Opportunités d'Emploi

# jobOpportunitiesDescription
source: Discover amazing job opportunities from verified companies. Apply directly and showcase your blockchain-verified credentials and AI-tested skills.
es: Descubre increíbles oportunidades de trabajo de empresas verificadas. Aplica directamente y muestra tus credenciales verificadas por blockchain y habilidades probadas por IA.
fr: Découvrez d'incroyables opportunités d'emploi d'entreprises vérifiées. Postulez directement et présentez vos références vérifiées par blockchain et vos compétences testées par IA.

source: Explore Job Offers
es: Explorar Ofertas de Trabajo
fr: Explorer les Offres d'Emploi

source: AI Career Advisor
es: Asesor de Carrera con IA
fr: Conseiller de Carrière IA

# aiCareerAdvisorDescription
source: Receive personalized career guidance based on your profile, goals, and market trends powered by advanced AI.
es: Recibe orientación profesional personalizada basada en tu perfil, objetivos y tendencias del mercado impulsada por IA avanzada.
fr: Recevez des conseils de carrière personnalisés basés sur votre profil, vos objectifs et les tendances du marché alimentés par l'IA avancée.

source: Get Career Guidance
es: Obtener Orientación Profesional
fr: Obtenir des Conseils de Carrière

source: Personalized
es: Personalizado
fr: Personnalisé

source: Free
es: Gratis
fr: Gratuit

# weeklyRecommendationsDescription
source: Receive curated weekly recommendations for jobs, skill development, and career opportunities tailored to your profile and goals.
es: Recibe recomendaciones semanales curadas para trabajos, desarrollo de habilidades y oportunidades profesionales adaptadas a tu perfil y objetivos.
fr: Recevez des recommandations hebdomadaires sélectionnées pour les emplois, le développement de compétences et les opportunités de carrière adaptées à votre profil et à vos objectifs.

source: View Recommendations
es: Ver Recomendaciones
fr: Voir les Recommandations

source: Smart
es: Inteligente
fr: Intelligent

source: Weekly
es: Semanal
fr: Hebdomadaire

source: Quick Actions
es: Acciones Rápidas
fr: Actions Rapides

# quickActionsDescription
source: Access your CV, manage your profile, view your certificates, and explore more features to enhance your professional presence.
es: Accede a tu CV, gestiona tu perfil, ve tus certificados y explora más características para mejorar tu presencia profesional.
fr: Accédez à votre CV, gérez votre profil, consultez vos certificats et explorez plus de fonctionnalités pour améliorer votre présence professionnelle.

source: View My CV
es: Ver Mi CV
fr: Voir Mon CV

# quickAccessProfile
source: Quick access to your profile
es: Acceso rápido a tu perfil
fr: Accès rapide à votre profil

source: Wallet address saved successfully!
es: ¡Dirección de billetera guardada exitosamente!
fr: Adresse de portefeuille sauvegardée avec succès !

# failedToSaveWalletAddress
source: Failed to save wallet address. The address might be invalid or already in use.
es: Error al guardar dirección de billetera. La dirección podría ser inválida o ya estar en uso.
fr: Échec de la sauvegarde de l'adresse de portefeuille. L'adresse pourrait être invalide ou déjà utilisée.

# pleaseEnterPassword
source: Please enter a password to encrypt your private key.
es: Por favor ingresa una contraseña para cifrar tu clave privada.
fr: Veuillez entrer un mot de passe pour chiffrer votre clé privée.

source: Creating wallet...
es: Creando billetera...
fr: Création du portefeuille...

# newWalletCreatedAndSaved
source: New wallet created and address saved!
es: ¡Nueva billetera creada y dirección guardada!
fr: Nouveau portefeuille créé et adresse sauvegardée !

source: Job Details
es: Detalles del Trabajo
fr: Détails du Poste

source: Skill Test Requirement
es: Requisito de Prueba de Habilidades
fr: Exigence de Test de Compétences

# skillTestRequirementMessage
source: To apply for this position, you need to complete skill tests. You currently have {currentTests} completed skill tests. The minimum requirement is {requiredTests} completed skill tests.
es: Para postularte a esta posición, necesitas completar pruebas de habilidades. Actualmente tienes {currentTests} pruebas de habilidades completadas. El requisito mínimo es {requiredTests} pruebas de habilidades completadas.
fr: Pour postuler à ce poste, vous devez compléter des tests de compétences. Vous avez actuellement {currentTests} tests de compétences complétés. L'exigence minimale est de {requiredTests} tests de compétences complétés.

source: Go to Skill Tests
es: Ir a Pruebas de Habilidades
fr: Aller aux Tests de Compétences

source: Close
es: Cerrar
fr: Fermer

source: Job Application Confirmation
es: Confirmación de Solicitud de Trabajo
fr: Confirmation de Candidature

# applyJobConfirmationMessage
source: Are you sure you want to apply for this job? Once submitted, your application cannot be undone.
es: ¿Estás seguro de que quieres postularte a este trabajo? Una vez enviada, tu solicitud no se puede deshacer.
fr: Êtes-vous sûr de vouloir postuler à ce poste ? Une fois soumise, votre candidature ne peut pas être annulée.

source: Application Successful!
es: ¡Solicitud Exitosa!
fr: Candidature Réussie !

# applicationSuccessfulMessage
source: Your application has been submitted successfully. The company will review your application and contact you if you are selected.
es: Tu solicitud ha sido enviada exitosamente. La empresa revisará tu solicitud y te contactará si eres seleccionado.
fr: Votre candidature a été soumise avec succès. L'entreprise examinera votre candidature et vous contactera si vous êtes sélectionné.

# alreadyApplied
source: You have already applied for this job.
es: Ya te has postulado a este trabajo.
fr: Vous avez déjà postulé à ce poste.

source: Go to Login
es: Ir a Iniciar Sesión
fr: Aller à la Connexion

source: Job Offer
es: Oferta de Trabajo
fr: Offre d'Emploi

source: Requirements
es: Requisitos
fr: Exigences

source: Responsibilities
es: Responsabilidades
fr: Responsabilités

source: Qualifications
es: Calificaciones

source: Benefits
es: Beneficios
fr: Avantages

source: Location
es: Ubicación
fr: Localisation

source: Salary
es: Salario
fr: Salaire

source: Experience Level
es: Nivel de Experiencia
fr: Niveau d'Expérience

source: Posted Date
es: Fecha de Publicación
fr: Date de Publication

source: Expiry Date
es: Fecha de Vencimiento
fr: Date d'Expiration

source: Today
es: Hoy
fr: Aujourd'hui

source: Yesterday
es: Ayer
fr: Hier

# daysAgo
source: {days} days ago
es: Hace {days} días
fr: Il y a {days} jours

# weeksAgo
source: {weeks} weeks ago
es: Hace {weeks} semanas
fr: Il y a {weeks} semaines

source: Recommended Actions
es: Acciones Recomendadas
fr: Actions Recommandées

# improveCvAction
source: Improve your CV to better match this job position
es: Mejora tu CV para que coincida mejor con esta posición de trabajo
fr: Améliorez votre CV pour mieux correspondre à ce poste

# completeSkillTestsAction
source: Complete skill tests to strengthen your application
es: Completa pruebas de habilidades para fortalecer tu solicitud
fr: Complétez les tests de compétences pour renforcer votre candidature

# updateProfileAction
source: Update your professional profile with relevant experience
es: Actualiza tu perfil profesional con experiencia relevante
fr: Mettez à jour votre profil professionnel avec une expérience pertinente

# buildNetworkAction
source: Build your professional network in this industry
es: Construye tu red profesional en esta industria
fr: Construisez votre réseau professionnel dans cette industrie

# jobExpired
source: This job offer has expired
es: Esta oferta de trabajo ha expirado
fr: Cette offre d'emploi a expiré

# applicationDeadlinePassed
source: The application deadline has passed
es: La fecha límite de solicitud ha pasado
fr: La date limite de candidature est passée

source: Applied
es: Postulado
fr: Postulé

source: Expired
es: Expirado
fr: Expiré

source: Deadline Passed
es: Fecha Límite Pasada
fr: Date Limite Dépassée

source: Welcome to SolidCV!
es: ¡Bienvenido a SolidCV!
fr: 🎉 Bienvenue sur SolidCV !

# signInToUnlock
source: Sign in to unlock AI-powered career tools and manage your verified credentials.
es: Inicia sesión para desbloquear herramientas de carrera con IA y gestionar tus credenciales verificadas.
fr: Connectez-vous pour débloquer les outils de carrière alimentés par l'IA et gérer vos identifiants vérifiés.

# emailPlaceholder
source: example@domain.com
es: ejemplo@dominio.com
fr: exemple@domaine.com

source: Forgot password
es: Olvidé mi contraseña
fr: Mot de passe oublié

# dontHaveAccount
source: Don't have an account?
es: ¿No tienes una cuenta?
fr: Vous n'avez pas de compte ?

source: Browse Job Opportunities
es: Explorar Oportunidades Laborales
fr: Parcourir les Opportunités d'Emploi

source: Checking authentication...
es: Verificando autenticación...
fr: Vérification de l'authentification...

source: Redirecting to home...
es: Redirigiendo al inicio...
fr: Redirection vers l'accueil...

source: Signing in...
es: Iniciando sesión...
fr: Connexion en cours...

source: Incorrect email or password.
es: Correo electrónico o contraseña incorrectos.
fr: E-mail ou mot de passe incorrect.

source: Account does not exist.
es: La cuenta no existe.
fr: Le compte n'existe pas.

source: AI-Powered Features
es: Características con IA
fr: Fonctionnalités IA

# superchargeYourCareer
source: Supercharge Your Career with AI
es: Potencia tu Carrera con IA
fr: Boostez Votre Carrière avec l'IA

# leverageCuttingEdgeAI
source: Leverage cutting-edge artificial intelligence to validate your skills, get personalized career advice, and find the perfect job matches.
es: Aprovecha la inteligencia artificial de vanguardia para validar tus habilidades, obtener consejos de carrera personalizados y encontrar las coincidencias de trabajo perfectas.
fr: Tirez parti de l'intelligence artificielle de pointe pour valider vos compétences, obtenir des conseils de carrière personnalisés et trouver les correspondances d'emploi parfaites.

source: AI Skill Validation
es: Validación de Habilidades con IA
fr: Validation des Compétences IA

# aiSkillValidationDescription
source: Get your skills assessed and verified by AI algorithms that analyze your experience, projects, and achievements.
es: Haz que tus habilidades sean evaluadas y verificadas por algoritmos de IA que analizan tu experiencia, proyectos y logros.
fr: Faites évaluer et vérifier vos compétences par des algorithmes d'IA qui analysent votre expérience, vos projets et vos réalisations.

source: AI Job Matching
es: Emparejamiento de Trabajos con IA
fr: Correspondance d'Emploi IA

# aiJobMatchingDescription
source: Recruiters get fast AI feedback on the match between you and the job offer based on your tested skills and CV credentials.
es: Los reclutadores obtienen retroalimentación rápida de IA sobre la coincidencia entre tú y la oferta de trabajo basada en tus habilidades probadas y credenciales de CV.
fr: Les recruteurs reçoivent un retour IA rapide sur la correspondance entre vous et l'offre d'emploi basée sur vos compétences testées et vos identifiants CV.

# readyToTransformCareer
source: Ready to Transform Your Career?
es: ¿Listo para Transformar tu Carrera?
fr: Prêt à Transformer Votre Carrière ?

# joinThousandsProfessionals
source: Join thousands of professionals who are already using AI to accelerate their career growth.
es: Únete a miles de profesionales que ya están usando IA para acelerar su crecimiento profesional.
fr: Rejoignez des milliers de professionnels qui utilisent déjà l'IA pour accélérer leur croissance de carrière.

source: Get Started Free
es: Comenzar Gratis
fr: Commencer Gratuitement

source: Explore Job Opportunities
es: Explorar Oportunidades de Trabajo
fr: Explorer les Opportunités d'Emploi

source: Explore Jobs
es: Explorar Trabajos
fr: Explorer les Emplois

source: Discover SolidCV
es: Descubre SolidCV
fr: Découvrez SolidCV

# reinventingTrustRecruitment
source: Reinventing Trust in Recruitment
es: Reinventando la Confianza en el Reclutamiento
fr: Réinventer la Confiance dans le Recrutement

# reinventingTrustDescription
source: In a market where one in five CVs may contain inaccuracies and keeping them updated is a hassle, SolidCV positions itself as a pioneer. We are shaping the future of recruitment with a platform where every qualification is strictly verifiable and every professional journey is highlighted with absolute integrity. Leave uncertainty behind and embrace a new era of transparency and reliability.
es: En un mercado donde uno de cada cinco CVs puede contener inexactitudes y mantenerlos actualizados es una molestia, SolidCV se posiciona como pionero. Estamos dando forma al futuro del reclutamiento con una plataforma donde cada cualificación es estrictamente verificable y cada trayectoria profesional se destaca con absoluta integridad. Deja atrás la incertidumbre y abraza una nueva era de transparencia y confiabilidad.
fr: Dans un marché où un CV sur cinq peut contenir des inexactitudes et où les tenir à jour est une corvée, SolidCV se positionne comme un pionnier. Nous façonnons l'avenir du recrutement avec une plateforme où chaque qualification est strictement vérifiable et chaque parcours professionnel est mis en valeur avec une intégrité absolue. Laissez l'incertitude derrière vous et embrassez une nouvelle ère de transparence et de fiabilité.

# blockchainRevolutionDiplomas
source: The Blockchain Revolution Serving Your Diplomas
es: La Revolución Blockchain al Servicio de tus Diplomas
fr: La Révolution Blockchain au Service de Vos Diplômes

# blockchainRevolutionDescription
source: SolidCV is based on the robustness of blockchain technology. Every diploma, certificate, and experience becomes a unique, tamper-proof NFT, secured in your personal digital wallet. Issuing institutions validate your achievements directly on the blockchain, providing recruiters with instant access to undeniable proof of your skills. Your career, authenticated and valued.
es: SolidCV se basa en la robustez de la tecnología blockchain. Cada diploma, certificado y experiencia se convierte en un NFT único e inalterable, asegurado en tu billetera digital personal. Las instituciones emisoras validan tus logros directamente en el blockchain, proporcionando a los reclutadores acceso instantáneo a pruebas innegables de tus habilidades. Tu carrera, autenticada y valorada.
fr: SolidCV repose sur la robustesse de la technologie blockchain. Chaque diplôme, certificat et expérience devient un NFT unique et inviolable, sécurisé dans votre portefeuille numérique personnel. Les institutions émettrices valident vos réalisations directement sur la blockchain, fournissant aux recruteurs un accès instantané à des preuves indéniables de vos compétences. Votre carrière, authentifiée et valorisée.

# virtuousEcosystemStakeholders
source: A Virtuous Ecosystem for All Stakeholders
es: Un Ecosistema Virtuoso para Todos los Interesados
fr: Un Écosystème Vertueux pour Toutes les Parties Prenantes

# virtuousEcosystemDescription
source: SolidCV weaves a network of mutual benefits: users retain full control over their professional identity and are rewarded for their active participation. Companies and educational institutions streamline their verification processes and contribute to a high standard of trust. Our innovative validation mechanism even allows you to integrate and validate your past experiences, ensuring a smooth transition to the CV of tomorrow.
es: SolidCV teje una red de beneficios mutuos: los usuarios mantienen el control total sobre su identidad profesional y son recompensados por su participación activa. Las empresas e instituciones educativas agilizan sus procesos de verificación y contribuyen a un alto estándar de confianza. Nuestro mecanismo de validación innovador incluso te permite integrar y validar tus experiencias pasadas, asegurando una transición suave al CV del mañana.
fr: SolidCV tisse un réseau d'avantages mutuels : les utilisateurs conservent un contrôle total sur leur identité professionnelle et sont récompensés pour leur participation active. Les entreprises et institutions éducatives rationalisent leurs processus de vérification et contribuent à un haut standard de confiance. Notre mécanisme de validation innovant vous permet même d'intégrer et de valider vos expériences passées, assurant une transition en douceur vers le CV de demain.

source: Who is SolidCV for?
es: ¿Para quién es SolidCV?
fr: À qui s'adresse SolidCV ?

source: For All Professionals
es: Para Todos los Profesionales
fr: Pour Tous les Professionnels

# forAllProfessionalsDescription
source: Whether you are a student, recent graduate, or experienced professional, SolidCV gives you the tools to showcase your skills in a verifiable way.
es: Ya seas estudiante, recién graduado o profesional experimentado, SolidCV te da las herramientas para mostrar tus habilidades de manera verificable.
fr: Que vous soyez étudiant, récent diplômé ou professionnel expérimenté, SolidCV vous donne les outils pour présenter vos compétences de manière vérifiable.

source: For Companies
es: Para Empresas
fr: Pour les Entreprises

# forCompaniesDescription
source: Recruit more efficiently with verified CVs, reducing time and verification costs.
es: Recluta de manera más eficiente con CVs verificados, reduciendo tiempo y costos de verificación.
fr: Recrutez plus efficacement avec des CV vérifiés, réduisant le temps et les coûts de vérification.

source: For Educational Institutions
es: Para Instituciones Educativas
fr: Pour les Institutions Éducatives

# forEducationalInstitutionsDescription
source: Offer your students tamper-proof, shareable digital certifications.
es: Ofrece a tus estudiantes certificaciones digitales inviolables y compartibles.
fr: Offrez à vos étudiants des certifications numériques inviolables et partageables.

source: Explore Solutions
es: Explorar Soluciones
fr: Explorer les Solutions
