Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Account Setup
es: Configuración de Cuenta
fr: Configuration du Compte

source: Wallet Already Connected
es: Billetera Ya Conectada
fr: Portefeuille Déjà Connecté

# walletConnectedDescription
source: Your blockchain wallet is already set up. Proceeding to CV upload.
es: Tu billetera blockchain ya está configurada. Procediendo a la carga de CV.
fr: Votre portefeuille blockchain est déjà configuré. Procédure vers le téléchargement de CV.

source: Start Setup
es: Iniciar Configuración
fr: Démarrer la Configuration

# requestDemo
source: Request a Demo
es: Solicitar una Demo
fr: Demander une Démo

# readyToRevolutionize
source: Ready to revolutionize your institution's credential management? Get in touch with our team!
es: ¿Listo para revolucionar la gestión de credenciales de tu institución? ¡Ponte en contacto con nuestro equipo!
fr: Prêt à révolutionner la gestion des identifiants de votre institution ? Contactez notre équipe !

# contactDemoSpecialist
source: Contact our demo specialist
es: Contacta a nuestro especialista en demos
fr: Contactez notre spécialiste en démonstrations

source: Email copied to clipboard
es: Correo copiado al portapapeles
fr: E-mail copié dans le presse-papiers

source: Copy email
es: Copiar email
fr: Copier l'email

# emailCopiedContactDemo
source: Email copied! Contact us for your demo.
es: ¡Email copiado! Contáctanos para tu demo.
fr: Email copié ! Contactez-nous pour votre démo.

# copyEmailAndContact
source: Copy Email & Contact
es: Copiar Email y Contactar
fr: Copier l'Email et Contacter

source: Revolutionize Academic Credentials
es: Revoluciona las Credenciales Académicas
fr: Révolutionnez les Identifiants Académiques

# joinFutureEducation
source: Join the future of education with blockchain-verified certificates, AI-powered career guidance, and seamless credential management for your institution.
es: Únete al futuro de la educación con certificados verificados por blockchain, orientación profesional impulsada por IA y gestión fluida de credenciales para tu institución.
fr: Rejoignez l'avenir de l'éducation avec des certificats vérifiés par blockchain, des conseils de carrière alimentés par l'IA et une gestion transparente des identifiants pour votre institution.

# powerfulFeaturesEducational
source: Powerful Features for Educational Excellence
es: Características Poderosas para la Excelencia Educativa
fr: Fonctionnalités Puissantes pour l'Excellence Éducative

# everythingInstitutionNeeds
source: Everything your institution needs to modernize credential management
es: Todo lo que tu institución necesita para modernizar la gestión de credenciales
fr: Tout ce dont votre institution a besoin pour moderniser la gestion des identifiants

source: Blockchain Certificates
es: Certificados Blockchain
fr: Certificats Blockchain

# blockchainCertificatesDescription
source: Issue tamper-proof, verifiable certificates using blockchain technology that employers can instantly verify.
es: Emite certificados verificables e inmutables usando tecnología blockchain que los empleadores pueden verificar instantáneamente.
fr: Émettez des certificats inviolables et vérifiables en utilisant la technologie blockchain que les employeurs peuvent vérifier instantanément.

source: AI Career Guidance
es: Orientación Profesional IA
fr: Orientation de Carrière IA

# aiCareerGuidanceDescription
source: Provide students with AI-powered career advice and skill assessments to enhance their employability.
es: Proporciona a los estudiantes consejos profesionales impulsados por IA y evaluaciones de habilidades para mejorar su empleabilidad.
fr: Fournissez aux étudiants des conseils de carrière alimentés par l'IA et des évaluations de compétences pour améliorer leur employabilité.

source: Alumni Network
es: Red de Egresados
fr: Réseau d'Anciens Élèves

# alumniNetworkDescription
source: Maintain connections with graduates and track their career progression for institutional reputation.
es: Mantén conexiones con graduados y rastrea su progreso profesional para la reputación institucional.
fr: Maintenez des connexions avec les diplômés et suivez leur progression de carrière pour la réputation institutionnelle.

# requestDemoButton
source: Request Demo
es: Solicitar Demo
fr: Demander une Démo

source: Why Choose SolidCV?
es: ¿Por qué elegir SolidCV?
fr: Pourquoi choisir SolidCV ?

# joinPlatformToday
source: Join the platform today
es: Únete a la plataforma hoy
fr: Rejoignez la plateforme aujourd'hui

source: Reduce Costs
es: Reducir Costos
fr: Réduire les Coûts

# reduceCostsDesc
source: Cut administrative overhead by up to 70%
es: Reducir los gastos administrativos hasta en un 70%
fr: Réduire les frais administratifs jusqu'à 70%

source: Enhance Security
es: Mejorar Seguridad
fr: Améliorer la Sécurité

# enhanceSecurityDesc
source: Eliminate credential fraud completely
es: Eliminar completamente el fraude de credenciales
fr: Éliminer complètement la fraude aux diplômes

source: Improve Reputation
es: Mejorar Reputación
fr: Améliorer la Réputation

# improveReputationDesc
source: Lead in educational innovation
es: Liderar en innovación educativa
fr: Leader en innovation éducative

source: Global Recognition
es: Reconocimiento Global
fr: Reconnaissance Mondiale

# globalRecognitionDesc
source: Instantly verifiable worldwide
es: Verificable instantáneamente en todo el mundo
fr: Vérifiable instantanément dans le monde entier

source: Blockchain-Powered Credentials
es: Credenciales con Tecnología Blockchain
fr: Diplômes Certifiés par Blockchain

# transformInstitution
source: Transform how your institution issues and manages academic credentials with cutting-edge blockchain technology.
es: Transforma cómo tu institución emite y gestiona credenciales académicas con tecnología blockchain de vanguardia.
fr: Transformez la façon dont votre institution délivre et gère les diplômes académiques avec la technologie blockchain de pointe.

source: Instant Verification
es: Verificación Instantánea
fr: Vérification Instantanée

# eliminateCredentialFraud
source: Elimination of credential fraud
es: Eliminación de fraude de credenciales
fr: Élimination de la fraude aux diplômes

# permanentRecords
source: Permanent, immutable records
es: Registros permanentes e inmutables
fr: Dossiers permanents et immuables

source: Reduced administrative costs
es: Costos administrativos reducidos
fr: Coûts administratifs réduits

# enhancedReputation
source: Enhanced institutional reputation
es: Reputación institucional mejorada
fr: Réputation institutionnelle améliorée

source: Course
es: Curso
fr: Cours

source: Loading course content...
es: Cargando contenido del curso...
fr: Chargement du contenu du cours...

# failedToLoadCourse
source: Failed to load course content
es: Error al cargar el contenido del curso
fr: Échec du chargement du contenu du cours

source: Please try again later
es: Por favor, inténtelo de nuevo más tarde
fr: Veuillez réessayer plus tard

source: No course content available
es: No hay contenido del curso disponible
fr: Aucun contenu de cours disponible

source: hours
es: horas
fr: heures

source: About this course
es: Acerca de este curso
fr: À propos de ce cours

source: Course Content
es: Contenido del Curso
fr: Contenu du Cours

# courseContentBeingGenerated
source: Course content is being generated...
es: Se está generando el contenido del curso...
fr: Le contenu du cours est en cours de génération...

# aiPoweredCourseContent
source: AI-powered course content will be available shortly. Please check back in a few moments.
es: El contenido del curso impulsado por IA estará disponible en breve. Por favor, vuelva a consultar en unos momentos.
fr: Le contenu du cours alimenté par l'IA sera disponible sous peu. Veuillez revérifier dans quelques instants.

source: Refresh Content
es: Actualizar Contenido
fr: Actualiser le Contenu

source: Test Your Knowledge
es: Pon a Prueba tu Conocimiento
fr: Testez Vos Connaissances

# takeQuizToTest
source: Take a quiz to test what you've learned
es: Realiza un cuestionario para probar lo que has aprendido
fr: Passez un quiz pour tester ce que vous avez appris

source: Start Quiz
es: Comenzar Cuestionario
fr: Commencer le Quiz

source: Course Quiz
es: Cuestionario del Curso
fr: Quiz du Cours

source: Quiz Passed!
es: ¡Cuestionario Aprobado!
fr: Quiz Réussi !

source: Quiz Failed
es: Cuestionario Reprobado
fr: Quiz Échoué

source: Score
es: Puntuación

source: Back to Recommendations
es: Volver a Recomendaciones
fr: Retour aux Recommandations

source: Back to Course
es: Volver al Curso
fr: Retour au Cours

source: Try Again
es: Intentar de Nuevo
fr: Réessayer

source: Knowledge Test
es: Prueba de Conocimiento
fr: Test de Connaissances

source: Loading questions...
es: Cargando preguntas...
fr: Chargement des questions...

source: Failed to load questions
es: Error al cargar las preguntas
fr: Échec du chargement des questions

source: No questions available
es: No hay preguntas disponibles
fr: Aucune question disponible

# courseNoQuestions
source: This course doesn't have any questions yet
es: Este curso aún no tiene preguntas
fr: Ce cours n'a pas encore de questions

source: Progress
es: Progreso
fr: Progrès

# questionsAnswered
source: of {total} questions answered
es: de {total} preguntas respondidas
fr: sur {total} questions répondues

source: Submit Quiz
es: Enviar Cuestionario
fr: Soumettre le Quiz

source: Question not available
es: Pregunta no disponible
fr: Question non disponible

source: Option not available
es: Opción no disponible
fr: Option non disponible

source: Failed to submit quiz
es: Error al enviar el cuestionario
fr: Échec de la soumission du quiz

# readyToRevolutionizeHiring
source: Ready to revolutionize your hiring process? Get in touch with our team!
es: ¿Listo para revolucionar tu proceso de contratación? ¡Ponte en contacto con nuestro equipo!
fr: Prêt à révolutionner votre processus d'embauche ? Contactez notre équipe !

# contactSalesSpecialist
source: Contact our sales specialist
es: Contacta a nuestro especialista en ventas
fr: Contactez notre spécialiste des ventes

# copyEmailButton
source: Copy Email
es: Copiar Email
fr: Copier l'Email

# speedupHiringProcess
source: Speedup your Hiring Process
es: Acelera tu Proceso de Contratación
fr: Accélérez votre Processus d'Embauche

# accessVerifiedProfessionals
source: Access verified professionals with blockchain-authenticated skills and experience. Make confident hiring decisions with AI-powered candidate matching.
es: Accede a profesionales verificados con habilidades y experiencia autenticadas por blockchain. Toma decisiones de contratación confiables con coincidencias de candidatos impulsadas por IA.
fr: Accédez à des professionnels vérifiés avec des compétences et une expérience authentifiées par blockchain. Prenez des décisions d'embauche en toute confiance avec la correspondance de candidats alimentée par l'IA.

source: Start Hiring
es: Comenzar a Contratar
fr: Commencer l'Embauche

# powerfulToolsRecruitment
source: Powerful Tools for Modern Recruitment
es: Herramientas Poderosas para el Reclutamiento Moderno
fr: Outils Puissants pour le Recrutement Moderne

# everythingNeedFindHire
source: Everything you need to find and hire the best talent efficiently
es: Todo lo que necesitas para encontrar y contratar el mejor talento de manera eficiente
fr: Tout ce dont vous avez besoin pour trouver et embaucher les meilleurs talents efficacement

source: Verified Credentials
es: Credenciales Verificadas
fr: Diplômes Vérifiés

# verifiedCredentialsDesc
source: Access candidates with blockchain-verified certificates and work experience that cannot be faked.
es: Accede a candidatos con certificados verificados por blockchain y experiencia laboral que no puede ser falsificada.
fr: Accédez à des candidats avec des certificats vérifiés par blockchain et une expérience de travail qui ne peut pas être falsifiée.

source: AI-Powered Matching
es: Coincidencias Impulsadas por IA
fr: Correspondance Alimentée par l'IA

# aiPoweredMatchingDesc
source: Find the perfect candidates using AI that analyzes skills, experience, and career trajectories.
es: Encuentra los candidatos perfectos usando IA que analiza habilidades, experiencia y trayectorias profesionales.
fr: Trouvez les candidats parfaits en utilisant l'IA qui analyse les compétences, l'expérience et les trajectoires de carrière.

# instantVerificationDesc
source: Verify candidate credentials instantly without waiting for manual verification processes.
es: Verifica las credenciales de los candidatos al instante sin esperar procesos de verificación manual.
fr: Vérifiez les diplômes des candidats instantanément sans attendre les processus de vérification manuelle.

source: Check My Skills with AI
es: Evalúa Mis Habilidades con IA
fr: Évaluer Mes Compétences avec l'IA

# answerQuestionsToCheckSkills
source: Answer the questions to check your skills in {skillName}
es: Responde las preguntas para evaluar tus habilidades en {skillName}
fr: Répondez aux questions pour évaluer vos compétences en {skillName}

source: Get Feedbacks On My Skills
es: Obtener Comentarios Sobre Mis Habilidades
fr: Obtenir des Commentaires sur Mes Compétences

# aiWillAskQuestionsToTest
source: AI: I will ask you some questions to test your skill
es: IA: Te haré algunas preguntas para evaluar tu habilidad
fr: IA : Je vais vous poser quelques questions pour tester votre compétence

source: Start Test
es: Iniciar Prueba
fr: Commencer le Test

source: Type your message...
es: Escribe tu mensaje...
fr: Tapez votre message...

source: Send
es: Enviar
fr: Envoyer

source: No data found
es: No se encontraron datos
fr: Aucune donnée trouvée

source: Add an Education Institution
es: Agregar una Institución Educativa
fr: Ajouter une Institution Éducative

# chooseLogoOrImage
source: Choose a logo or image
es: Elige un logo o imagen
fr: Choisissez un logo ou une image

source: Education Institution added!
es: ¡Institución Educativa agregada!
fr: Institution Éducative ajoutée !

source: Add a Company
es: Agregar una Empresa
fr: Ajouter une Entreprise

# chooseCompanyLogoOrImage
source: Choose a company logo or image
es: Elige un logo o imagen de empresa
fr: Choisissez un logo ou une image d'entreprise

source: Create Company
es: Crear Empresa
fr: Créer l'Entreprise

source: Company created!
es: ¡Empresa creada!
fr: Entreprise créée !

source: Search for a user
es: Buscar un usuario
fr: Rechercher un utilisateur

# mySkillsTitle
source: Skills
es: Habilidades
fr: Compétences

# mySkillsAddTooltip
source: Add skill
es: Agregar habilidad
fr: Ajouter une compétence

# mySkillsNoSkillsFound
source: No skills found. Add your first skill!
es: No se encontraron habilidades. ¡Agrega tu primera habilidad!
fr: Aucune compétence trouvée. Ajoutez votre première compétence !

# mySkillsDialogTitle
source: Add a Skill
es: Agregar una Habilidad
fr: Ajouter une Compétence

# mySkillsSkillNameLabel
source: Skill name
es: Nombre de la habilidad
fr: Nom de la compétence

# mySkillsSkillNameHint
source: E.g. Flutter, Project Management...
es: Ej. Flutter, Gestión de Proyectos...
fr: Ex. Flutter, Gestion de Projet...

# mySkillsSkillNameError
source: Please enter a skill name
es: Por favor ingresa un nombre de habilidad
fr: Veuillez entrer un nom de compétence

# mySkillsCancel
source: Cancel
es: Cancelar
fr: Annuler

# mySkillsAdd
source: + Add
es: + Agregar
fr: + Ajouter

# mySkillsSkillAdded
source: Skill added!
es: ¡Habilidad agregada!
fr: Compétence ajoutée !

# myEducationInstitutionsNoInstitutions
source: No education institutions found.
es: No se encontraron instituciones educativas.
fr: Aucune institution éducative trouvée.

# myEducationInstitutionsUnnamedInstitution
source: Unnamed Institution
es: Institución Sin Nombre
fr: Institution Sans Nom

# myCompaniesNoCompanies
source: No companies found.
es: No se encontraron empresas.
fr: Aucune entreprise trouvée.

# myCompaniesUnnamedCompany
source: Unnamed Company
es: Empresa Sin Nombre
fr: Entreprise Sans Nom

# logoutDialogTitle
source: Log out
es: Cerrar sesión
fr: Se déconnecter

# logoutDialogMessage
source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# logoutDialogCancel
source: Cancel
es: Cancelar
fr: Annuler

# logoutDialogConfirm
source: Log out
es: Cerrar sesión
fr: Se déconnecter

# addCertificateDialogTitle
source: Add Certificate
es: Agregar Certificado
fr: Ajouter Certificat

# addCertificateDialogTitleFull
source: Add New Certificate
es: Agregar Nuevo Certificado
fr: Ajouter Nouveau Certificat

# addCertificateTitle
source: Add Certificate
es: Agregar Certificado
fr: Ajouter un Certificat

# addCertificateCertificateType
source: Certificate Type
es: Tipo de Certificado
fr: Type de Certificat

# addCertificateGrade
source: Grade
es: Calificación
fr: Note

# addCertificateTeachingInstitution
source: Teaching Institution
es: Institución Educativa
fr: Institution d'Enseignement

# addCertificateDescription
source: Description
es: Descripción

# addCertificateCurriculum
source: Curriculum
es: Currículo
fr: Programme

# addCertificatePublicationDate
source: Publication Date
es: Fecha de Publicación
fr: Date de Publication

# addCertificateSelectFile
source: Select a file
es: Seleccionar un archivo
fr: Sélectionner un fichier

# addCertificateCancel
source: Cancel
es: Cancelar
fr: Annuler

# addCertificateAdd
source: Add
es: Agregar
fr: Ajouter

# addCertificateDateRequired
source: Please select a date
es: Por favor selecciona una fecha
fr: Veuillez sélectionner une date

# addCertificateFieldRequired
source: Please enter {field}
es: Por favor ingresa {field}
fr: Veuillez entrer {field}

# addWorkExperienceTitle
source: Add Work Experience
es: Agregar Experiencia Laboral
fr: Ajouter Expérience Professionnelle

# addWorkExperienceJobTitle
source: Title
es: Título
fr: Titre

# addWorkExperienceCompany
source: Company
es: Empresa
fr: Entreprise

# addWorkExperienceLocation
source: Location
es: Ubicación
fr: Lieu

# addWorkExperienceDescription
source: Description
es: Descripción

# addWorkExperienceStartDate
source: Start
es: Inicio
fr: Début

# addWorkExperienceEndDate
source: End
es: Fin
fr: Fin

# addWorkExperienceCancel
source: Cancel
es: Cancelar
fr: Annuler

# addWorkExperienceSave
source: Save
es: Guardar
fr: Enregistrer

# addWorkExperienceFieldRequired
source: Enter {field}
es: Ingresa {field}
fr: Entrez {field}

# addWorkExperienceDateRequired
source: Enter {field} date
es: Ingresa fecha de {field}
fr: Entrez date de {field}

# editProfileTitle
source: Edit Profile
es: Editar Perfil
fr: Modifier le Profil

# editProfileUpdated
source: Profile updated!
es: ¡Perfil actualizado!
fr: Profil mis à jour !

# editProfileErrorLoading
source: Error loading user data: {error}
es: Error cargando datos del usuario: {error}
fr: Erreur lors du chargement des données utilisateur : {error}

# editProfileRetry
source: Retry
es: Reintentar
fr: Réessayer

# editProfileUserNotFound
source: User not found
es: Usuario no encontrado
fr: Utilisateur introuvable

# editProfileChangePhoto
source: Change profile photo
es: Cambiar foto de perfil
fr: Changer la photo de profil

# editProfileFirstName
source: First Name
es: Nombre
fr: Prénom

# editProfileLastName
source: Last Name
es: Apellido
fr: Nom

# editProfilePhoneNumber
source: Phone Number
es: Número de Teléfono
fr: Numéro de Téléphone

# editProfileBiography
source: Biography
es: Biografía
fr: Biographie

# editProfileEmailSubtitle
source: Get personalized career recommendations via email
es: Recibe recomendaciones profesionales personalizadas por email
fr: Recevez des recommandations de carrière personnalisées par email

# editProfileSaving
source: Saving...
es: Guardando...
fr: Enregistrement...

# editProfileSave
source: Save Profile
es: Guardar Perfil
fr: Enregistrer le Profil

# editProfileRequired
source: Required
es: Requerido
fr: Requis

# workExperienceVerified
source: Verified
es: Verificado
fr: Vérifié

# workExperienceManually
source: Manually
es: Manual
fr: Manuel

# skillsTitle
source: Skills
es: Habilidades
fr: Compétences

# skillsNoSkillsFound
source: No skills found
es: No se encontraron habilidades
fr: Aucune compétence trouvée

# skillsGetAIFeedback
source: Get AI Feedback
es: Obtener Comentarios de IA
fr: Obtenir Commentaires IA

# skillsJobDescription
source: Job Description
es: Descripción del Trabajo
fr: Description du Poste

# skillsJobDescriptionHint
source: Enter the job description here...
es: Ingrese la descripción del trabajo aquí...
fr: Entrez la description du poste ici...

# skillsSubmit
source: Submit
es: Enviar
fr: Soumettre

# skillsHideForm
source: Hide form
es: Ocultar formulario
fr: Masquer le formulaire

# skillsDescribeJob
source: Describe your job to see if it is a good fit for you
es: Describe tu trabajo para ver si es una buena opción para ti
fr: Décrivez votre travail pour voir s'il vous convient

# userProfileNotAvailable
source: Not available
es: No disponible
fr: Non disponible

# educationVerified
source: Verified
es: Verificado
fr: Vérifié

# educationManually
source: Manually
es: Manual
fr: Manuel

# educationUntitled
source: Untitled
es: Sin título
fr: Sans titre

# educationCertificate
source: Certificate
es: Certificado
fr: Certificat

# educationDate
source: Date: {date}
es: Fecha: {date}

# educationCurriculum
source: Curriculum: {curriculum}
es: Currículo: {curriculum}
fr: Programme : {curriculum}

# educationGrade
source: Grade: {grade}
es: Calificación: {grade}
fr: Note : {grade}

# educationTitle
source: Education
es: Educación
fr: Éducation

# educationNoCertificates
source: No education certificate yet.
es: Aún no hay certificados de educación.
fr: Aucun certificat d'éducation pour le moment.

# workExperienceVerifiedBlockchain
source: Verified by the blockchain
es: Verificado por la blockchain
fr: Vérifié par la blockchain

# workExperienceManuallyAdded
source: Manually added
es: Añadido manualmente
fr: Ajouté manuellement

# verifiedByBlockchain
source: Verified by the blockchain
es: Verificado por la blockchain
fr: Vérifié par la blockchain

source: Manually added
es: Añadido manualmente
fr: Ajouté manuellement

source: Untitled
es: Sin título
fr: Sans titre

# certificateType
source: Type (e.g. Diploma, Certificate, etc.)
es: Tipo (ej. Diploma, Certificado, etc.)
fr: Type (ex. Diplôme, Certificat, etc.)

source: Date
es: Fecha

source: Curriculum
es: Plan de estudios
fr: Programme

source: Grade
es: Calificación
fr: Note

source: Feedbacks
es: Comentarios
fr: Commentaires

# addPromotion
source: Add a promotion
es: Agregar una promoción
fr: Ajouter une promotion

# addPromotionDialogTitle
source: Add a promotion
es: Agregar una promoción
fr: Ajouter une promotion

source: Promotion title
es: Título de promoción
fr: Titre de promotion

source: Confirm Deletion
es: Confirmar Eliminación
fr: Confirmer la Suppression

# deleteExperienceConfirmation
source: Are you sure you want to delete this experience? This action is irreversible.
es: ¿Estás seguro de que quieres eliminar esta experiencia? Esta acción es irreversible.
fr: Êtes-vous sûr de vouloir supprimer cette expérience ? Cette action est irréversible.

source: Certificate
es: Certificado
fr: Certificat

# deleteCertificateConfirmation
source: Are you sure you want to delete this certificate? This action is irreversible.
es: ¿Estás seguro de que quieres eliminar este certificado? Esta acción es irreversible.
fr: Êtes-vous sûr de vouloir supprimer ce certificat ? Cette action est irréversible.

source: Error deleting certificate
es: Error al eliminar certificado
fr: Erreur lors de la suppression du certificat

source: Setup
es: Configurar
fr: Configuration

source: Add your LinkedIn
es: Agrega tu LinkedIn
fr: Ajoutez votre LinkedIn
