Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: No Advice Available
es: Sin Consejos Disponibles
fr: Aucun Conseil Disponible

# noAdviceGenerated
source: We couldn't generate career advice at this time. Please try again later.
es: No pudimos generar consejos profesionales en este momento. Por favor intenta más tarde.
fr: Nous n'avons pas pu générer de conseils de carrière pour le moment. Veuillez réessayer plus tard.

# personalizedCareerAdvice
source: Your Personalized Career Advice
es: Tus Consejos Profesionales Personalizados
fr: Vos Conseils de Carrière Personnalisés

# generatedWithBackup
source: Generated with backup system
es: Generado con sistema de respaldo
fr: Généré avec le système de secours

# aiGeneratedInsights
source: AI-generated insights based on your profile
es: Perspectivas generadas por IA basadas en tu perfil
fr: Insights générés par IA basés sur votre profil

# backupSystemNote
source: Note: This advice was generated using our backup system due to connectivity issues.
es: Nota: Este consejo fue generado usando nuestro sistema de respaldo debido a problemas de conectividad.
fr: Note : Ce conseil a été généré en utilisant notre système de secours en raison de problèmes de connectivité.

source: Career Summary
es: Resumen Profesional
fr: Résumé de Carrière

source: Key Recommendations
es: Recomendaciones Clave
fr: Recommandations Clés

source: Skill Development
es: Desarrollo de Habilidades
fr: Développement des Compétences

source: Next Steps
es: Próximos Pasos
fr: Prochaines Étapes

source: Recommended Resources
es: Recursos Recomendados
fr: Ressources Recommandées

source: No items available
es: No hay elementos disponibles
fr: Aucun élément disponible

source: No resources available
es: No hay recursos disponibles
fr: Aucune ressource disponible

source: Untitled Resource
es: Recurso Sin Título
fr: Ressource Sans Titre

source: URL copied to clipboard!
es: ¡URL copiada al portapapeles!
fr: URL copiée dans le presse-papiers !

source: Update My CV
es: Actualizar Mi CV
fr: Mettre à Jour Mon CV

source: Get New Advice
es: Obtener Nuevos Consejos
fr: Obtenir de Nouveaux Conseils

# noPasteAllowed
source: Please type your answer manually. Copy/paste is disabled to ensure authentic responses.
es: Por favor escribe tu respuesta manualmente. Copiar/pegar está deshabilitado para asegurar respuestas auténticas.

source: Error
fr: Erreur

source: No
fr: Non

# mySkillsError
source: Error: {error}
fr: Erreur : {error}

# myEducationInstitutionsError
source: Error: {error}
fr: Erreur : {error}

# myCompaniesError
source: Error: {error}
fr: Erreur : {error}

# editProfileError
source: Error: {error}
fr: Erreur : {error}

# skillsError
source: Error: {error}
fr: Erreur : {error}

# educationError
source: Error: {error}
fr: Erreur : {error}

# ctrlEnterShortcut
source: Ctrl+ Enter
fr: Ctrl+ Entrée

# errorText
source: Error
fr: Erreur
