Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Home
es: Inicio
fr: Accueil

source: Jobs
es: Empleos
fr: Emplois

source: Companies
es: Empresas
fr: Entreprises

source: Education Institutions
es: Instituciones Educativas
fr: Institutions Éducatives

source: My CV
es: Mi CV
fr: Mon CV

source: Career Advice
es: Consejos Profesionales
fr: Conseils de Carrière

source: Login
es: Iniciar Sesión
fr: Se Connecter

source: Register
es: Registrarse
fr: S'inscrire

source: Logout
es: Cerrar Sesión
fr: Se Déconnecter

source: Email
es: Correo Electrónico

source: Password
es: Contraseña
fr: Mot de passe

source: First Name
es: Nombre
fr: Prénom

source: Last Name
es: Apellido
fr: Nom de Famille

source: Full Name
es: Nombre Completo
fr: Nom Complet

source: Save
es: Guardar
fr: Enregistrer

source: Cancel
es: Cancelar
fr: Annuler

source: Edit
es: Editar
fr: Modifier

source: Delete
es: Eliminar
fr: Supprimer

source: Add
es: Agregar
fr: Ajouter

source: Search
es: Buscar
fr: Rechercher

source: Loading...
es: Cargando...
fr: Chargement...

source: Success
es: Éxito
fr: Succès

source: Welcome
es: Bienvenido
fr: Bienvenue

# welcomeMessage
source: 👋 Welcome to SolidCV!
es: 👋 ¡Bienvenido a SolidCV!
fr: 👋 Bienvenue sur SolidCV !

source: Get Started
es: Comenzar
fr: Commencer

source: Learn More
es: Saber Más
fr: En Savoir Plus

source: Verify Credentials
es: Verificar Credenciales
fr: Vérifier les Références

source: Blockchain Security
es: Seguridad Blockchain
fr: Sécurité Blockchain

source: NFT Certificates
es: Certificados NFT
fr: Certificats NFT

source: Professional Profile
es: Perfil Profesional
fr: Profil Professionnel

source: Work Experience
es: Experiencia Laboral
fr: Expérience Professionnelle

source: Education
es: Educación
fr: Éducation

source: Skills
es: Habilidades
fr: Compétences

source: Certificates
es: Certificados
fr: Certificats

source: Portfolio
es: Portafolio

source: Contact Information
es: Información de Contacto
fr: Informations de Contact

source: Phone Number
es: Número de Teléfono
fr: Numéro de Téléphone

source: Address
es: Dirección
fr: Adresse

source: Website
es: Sitio Web
fr: Site Web

source: Job Title
es: Título del Trabajo
fr: Titre du Poste

source: Company
es: Empresa
fr: Entreprise

source: Start Date
es: Fecha de Inicio
fr: Date de Début

source: End Date
es: Fecha de Finalización
fr: Date de Fin

source: Current Position
es: Posición Actual
fr: Poste Actuel

source: Description
es: Descripción

source: Degree
es: Título
fr: Diplôme

source: Institution
es: Institución

source: Field of Study
es: Campo de Estudio
fr: Domaine d'Études

source: Graduation Year
es: Año de Graduación
fr: Année de Diplôme

source: Skill Name
es: Nombre de Habilidad
fr: Nom de Compétence

source: Proficiency Level
es: Nivel de Competencia
fr: Niveau de Maîtrise

source: Beginner
es: Principiante
fr: Débutant

source: Intermediate
es: Intermedio
fr: Intermédiaire

source: Advanced
es: Avanzado
fr: Avancé

source: Expert
es: Experto

source: Apply
es: Postularse
fr: Postuler

source: View Details
es: Ver Detalles
fr: Voir les Détails

source: Upload Document
es: Subir Documento
fr: Télécharger un Document

source: Download CV
es: Descargar CV
fr: Télécharger le CV

source: Share CV
es: Compartir CV
fr: Partager le CV

source: Verify CV
es: Verificar CV
fr: Vérifier le CV

source: Language
es: Idioma
fr: Langue

source: Change Language
es: Cambiar Idioma
fr: Changer de Langue

source: English
es: Inglés
fr: Anglais

source: Spanish
es: Español
fr: Espagnol

source: French
es: Francés
fr: Français

# editProfileLanguageUpdated
source: Profile language preference updated successfully
es: Preferencia de idioma del perfil actualizada exitosamente

# editProfileLanguageError
source: Failed to update language preference
es: Error al actualizar la preferencia de idioma

source: Settings
es: Configuración
fr: Paramètres

source: Profile
es: Perfil
fr: Profil

source: Privacy Policy
es: Política de Privacidad
fr: Politique de Confidentialité

source: Terms and Conditions
es: Términos y Condiciones
fr: Conditions Générales

source: About Us
es: Acerca de Nosotros
fr: À Propos de Nous

source: Contact Us
es: Contáctanos
fr: Nous Contacter

source: Help Center
es: Centro de Ayuda
fr: Centre d'Aide

source: FAQ
es: Preguntas Frecuentes
fr: Questions Fréquentes

source: Notifications
es: Notificaciones

source: Email Notifications
es: Notificaciones por Correo
fr: Notifications par E-mail

source: Weekly Recommendations
es: Recomendaciones Semanales
fr: Recommandations Hebdomadaires

# receiveWeeklyEmails
source: Receive Weekly Recommendation Emails
es: Recibir Correos de Recomendaciones Semanales
fr: Recevoir des E-mails de Recommandations Hebdomadaires

source: Yes
es: Sí
fr: Oui

source: Enabled
es: Habilitado
fr: Activé

source: Disabled
es: Deshabilitado
fr: Désactivé

source: Edit Profile
es: Editar Perfil
fr: Modifier le Profil

source: Profile updated!
es: ¡Perfil actualizado!
fr: Profil mis à jour !

source: Error loading user data
es: Error cargando datos del usuario
fr: Erreur lors du chargement des données utilisateur

source: User not found.
es: Usuario no encontrado.
fr: Utilisateur non trouvé.

source: Retry
es: Reintentar
fr: Réessayer

source: Saving...
es: Guardando...
fr: Enregistrement...

source: Save Profile
es: Guardar Perfil
fr: Enregistrer le Profil

source: Change profile photo
es: Cambiar foto de perfil
fr: Changer la photo de profil

source: Required
es: Requerido
fr: Requis

source: Biography
es: Biografía
fr: Biographie

# weeklyEmailsDescription
source: Get personalized career recommendations via email
es: Recibe recomendaciones profesionales personalizadas por correo electrónico
fr: Recevez des recommandations de carrière personnalisées par e-mail

source: Verified
es: Verificado
fr: Vérifié

source: Manually
es: Manual
fr: Manuel

source: Search User
es: Buscar Usuario
fr: Rechercher un Utilisateur

source: No user found.
es: No se encontró usuario.
fr: Aucun utilisateur trouvé.

source: Error while searching.
es: Error al buscar.
fr: Erreur lors de la recherche.

# searchForUser
source: Search for a user
es: Buscar un usuario
fr: Rechercher un utilisateur

# pleaseEnterSkillName
source: Please enter a skill name
es: Por favor ingresa el nombre de la habilidad
fr: Veuillez saisir le nom de la compétence

# errorMarkingCourseCompleted
source: Error marking course as completed
es: Error marcando curso como completado
fr: Erreur lors du marquage du cours comme terminé

source: Error loading recommendations
es: Error cargando recomendaciones
fr: Erreur lors du chargement des recommandations

# takesJustThreeMinutes
source: Takes just 3 minutes • No wallet required to start
es: Solo toma 3 minutos • No se requiere billetera para comenzar
fr: Prend seulement 3 minutes • Aucun portefeuille requis pour commencer

source: AI Career Advice
es: Consejos Profesionales con IA
fr: Conseils de Carrière IA

# personalizedCareerGuidance
source: Personalized career guidance using artificial intelligence
es: Orientación profesional personalizada usando inteligencia artificial
fr: Orientation de carrière personnalisée utilisant l'intelligence artificielle

# blockchainVerifiedJobOpportunities
source: Browse blockchain-verified job opportunities
es: Explora oportunidades laborales verificadas con blockchain
fr: Explorez les opportunités d'emploi vérifiées par blockchain

# directoryOfVerifiedCompanies
source: Directory of verified companies and employers
es: Directorio de empresas y empleadores verificados
fr: Répertoire d'entreprises et d'employeurs vérifiés

# blockchainPoweredProfessionalCv
source: Blockchain-powered professional CV platform with AI career guidance
es: Plataforma profesional de CV con tecnología blockchain y orientación profesional con IA
fr: Plateforme professionnelle de CV avec technologie blockchain et orientation de carrière IA

source: Error generating sitemap
es: Error generando mapa del sitio
fr: Erreur lors de la génération du plan du site

source: Configuration
es: Configuración

# courseMarkedCompleted
source: Course marked as completed!
es: ¡Curso marcado como completado!
fr: Cours marqué comme terminé !

# registrationConfirmed
source: Your registration has been confirmed!
es: ¡Tu registro ha sido confirmado!
fr: Votre inscription a été confirmée !

source: Could not confirm registration.
es: No se pudo confirmar el registro.
fr: Impossible de confirmer l'inscription.

source: No recommendations available
es: No hay recomendaciones disponibles
fr: Aucune recommandation disponible

# checkBackLaterForRecommendations
source: Check back later for new recommendations
es: Revisa más tarde para nuevas recomendaciones
fr: Revenez plus tard pour de nouvelles recommandations

source: Boost your career this week
es: Impulsa tu carrera esta semana
fr: Boostez votre carrière cette semaine

source: Weekly Progress
es: Progreso Semanal
fr: Progrès Hebdomadaire

source: Courses
es: Cursos
fr: Cours

source: Events
es: Eventos
fr: Événements

source: Recommended Courses
es: Cursos Recomendados
fr: Cours Recommandés

source: Recommended Events
es: Eventos Recomendados
fr: Événements Recommandés

source: No courses available this week
es: No hay cursos disponibles esta semana
fr: Aucun cours disponible cette semaine

source: No events available this week
es: No hay eventos disponibles esta semana
fr: Aucun événement disponible cette semaine

source: Untitled Course
es: Curso Sin Título
fr: Cours Sans Titre

source: By
es: Por
fr: Par

source: Completed
es: Completado
fr: Terminé

source: Review Course
es: Revisar Curso
fr: Réviser le Cours

source: Start Course
es: Iniciar Curso
fr: Commencer le Cours

source: Untitled Event
es: Evento Sin Título
fr: Événement Sans Titre

source: Registered
es: Registrado
fr: Inscrit

source: Could not open event URL
es: No se pudo abrir la URL del evento
fr: Impossible d'ouvrir l'URL de l'événement

# goToEventWebsite
source: Go to the event website
es: Ir al sitio web del evento
fr: Aller au site web de l'événement

# iHaveRegisteredToEvent
source: I have registered to the event
es: Me he registrado al evento
fr: Je me suis inscrit à l'événement

# completePercentage
source: % Complete
es: % Completado
fr: % Terminé

source: tasks
es: tareas
fr: tâches

source: Verify a CV
es: Verificar un CV
fr: Vérifier un CV

# searchForUserVerifyCV
source: Search for a user and verify their CV
es: Busca un usuario y verifica su CV
fr: Recherchez un utilisateur et vérifiez son CV

source: No work experiences yet.
es: Aún no hay experiencias laborales.
fr: Aucune expérience professionnelle pour le moment.

# lastUpdated
source: Last updated: June 2025
es: Última actualización: Junio 2025
fr: Dernière mise à jour : Juin 2025

# termsFooterAcknowledgment
source: By using SolidCV, you acknowledge that you have read, understood, and agree to be bound by these Terms and Conditions.
es: Al usar SolidCV, reconoces que has leído, entendido y aceptas estar sujeto a estos Términos y Condiciones.
fr: En utilisant SolidCV, vous reconnaissez avoir lu, compris et accepté d'être lié par ces Conditions Générales.

# termsSection1Title
source: 1. Introduction
es: 1. Introducción

# termsSection1Content
source: Welcome to SolidCV. These Terms and Conditions ('Terms') govern your use of our platform and services. By accessing or using SolidCV, you agree to be bound by these Terms. If you do not agree to these Terms, please do not use our services.
es: Bienvenido a SolidCV. Estos Términos y Condiciones ('Términos') rigen el uso de nuestra plataforma y servicios. Al acceder o usar SolidCV, aceptas estar sujeto a estos Términos. Si no aceptas estos Términos, por favor no uses nuestros servicios.
fr: Bienvenue sur SolidCV. Ces Conditions Générales ('Conditions') régissent votre utilisation de notre plateforme et services. En accédant ou en utilisant SolidCV, vous acceptez d'être lié par ces Conditions. Si vous n'acceptez pas ces Conditions, veuillez ne pas utiliser nos services.

# termsSection2Title
source: 2. Description of Service
es: 2. Descripción del Servicio
fr: 2. Description du Service

# termsSection2Content
source: SolidCV is a blockchain-powered CV/Resume management platform that allows users to create, manage, and verify their professional credentials through NFT-based certificates and work experience tokens. Our platform combines traditional CV management with blockchain technology for credential verification and AI-powered career guidance.
es: SolidCV es una plataforma de gestión de CV/Currículum impulsada por blockchain que permite a los usuarios crear, gestionar y verificar sus credenciales profesionales a través de certificados basados en NFT y tokens de experiencia laboral. Nuestra plataforma combina la gestión tradicional de CV con tecnología blockchain para verificación de credenciales y orientación profesional impulsada por IA.
fr: SolidCV est une plateforme de gestion de CV alimentée par la blockchain qui permet aux utilisateurs de créer, gérer et vérifier leurs identifiants professionnels grâce à des certificats basés sur NFT et des jetons d'expérience de travail. Notre plateforme combine la gestion traditionnelle de CV avec la technologie blockchain pour la vérification des identifiants et les conseils de carrière alimentés par l'IA.

# termsSection3Title
source: 3. User Accounts and Registration
es: 3. Cuentas de Usuario y Registro
fr: 3. Comptes Utilisateur et Inscription

# termsSection3Content
source: To use our services, you must: • Be at least 18 years old or have parental consent • Provide accurate and complete registration information • Maintain the security of your account credentials • Accept responsibility for all activities under your account • Notify us immediately of any unauthorized use of your account
es: Para usar nuestros servicios, debes: • Tener al menos 18 años o consentimiento parental • Proporcionar información de registro precisa y completa • Mantener la seguridad de las credenciales de tu cuenta • Aceptar responsabilidad por todas las actividades bajo tu cuenta • Notificarnos inmediatamente de cualquier uso no autorizado de tu cuenta
fr: Pour utiliser nos services, vous devez : • Avoir au moins 18 ans ou le consentement parental • Fournir des informations d'inscription précises et complètes • Maintenir la sécurité de vos identifiants de compte • Accepter la responsabilité de toutes les activités sous votre compte • Nous informer immédiatement de toute utilisation non autorisée de votre compte

# termsSection4Title
source: 4. Acceptable Use
es: 4. Uso Aceptable
fr: 4. Utilisation Acceptable

# termsSection4Content
source: You agree to use SolidCV only for lawful purposes and in accordance with these Terms. You may not: • Upload false, misleading, or fraudulent information • Violate any applicable laws or regulations • Infringe on the rights of others • Attempt to gain unauthorized access to our systems • Use our services for any commercial purpose without permission • Upload malicious code or engage in any harmful activities
es: Aceptas usar SolidCV solo para propósitos legales y de acuerdo con estos Términos. No puedes: • Subir información falsa, engañosa o fraudulenta • Violar cualquier ley o regulación aplicable • Infringir los derechos de otros • Intentar obtener acceso no autorizado a nuestros sistemas • Usar nuestros servicios para cualquier propósito comercial sin permiso • Subir código malicioso o participar en actividades dañinas
fr: Vous acceptez d'utiliser SolidCV uniquement à des fins légales et conformément à ces Conditions. Vous ne pouvez pas : • Télécharger des informations fausses, trompeuses ou frauduleuses • Violer toute loi ou réglementation applicable • Porter atteinte aux droits d'autrui • Tenter d'obtenir un accès non autorisé à nos systèmes • Utiliser nos services à des fins commerciales sans autorisation • Télécharger du code malveillant ou vous engager dans des activités nuisibles

# termsSection5Title
source: 5. Blockchain and NFT Services
es: 5. Servicios de Blockchain y NFT
fr: 5. Services Blockchain et NFT

# termsSection5Content
source: SolidCV utilizes blockchain technology for credential verification: • NFT certificates are minted on the Ethereum blockchain • Work experience tokens are stored on IPFS • Blockchain transactions may incur gas fees • We do not control blockchain networks or their availability • Digital assets may have value fluctuations • You are responsible for managing your wallet and private keys
es: SolidCV utiliza tecnología blockchain para verificación de credenciales: • Los certificados NFT se acuñan en la blockchain de Ethereum • Los tokens de experiencia laboral se almacenan en IPFS • Las transacciones blockchain pueden incurrir en tarifas de gas • No controlamos las redes blockchain o su disponibilidad • Los activos digitales pueden tener fluctuaciones de valor • Eres responsable de gestionar tu billetera y claves privadas
fr: SolidCV utilise la technologie blockchain pour la vérification des identifiants : • Les certificats NFT sont frappés sur la blockchain Ethereum • Les jetons d'expérience de travail sont stockés sur IPFS • Les transactions blockchain peuvent entraîner des frais de gaz • Nous ne contrôlons pas les réseaux blockchain ou leur disponibilité • Les actifs numériques peuvent avoir des fluctuations de valeur • Vous êtes responsable de la gestion de votre portefeuille et clés privées

# termsSection6Title
source: 6. Data and Privacy
es: 6. Datos y Privacidad
fr: 6. Données et Confidentialité

# termsSection6Content
source: Your privacy is important to us. Our data practices are governed by our Privacy Policy, which is incorporated into these Terms by reference. By using our services, you consent to the collection, use, and sharing of your information as described in our Privacy Policy.
es: Tu privacidad es importante para nosotros. Nuestras prácticas de datos se rigen por nuestra Política de Privacidad, que se incorpora a estos Términos por referencia. Al usar nuestros servicios, consientes la recopilación, uso y compartición de tu información como se describe en nuestra Política de Privacidad.
fr: Votre confidentialité est importante pour nous. Nos pratiques de données sont régies par notre Politique de Confidentialité, qui est incorporée dans ces Conditions par référence. En utilisant nos services, vous consentez à la collecte, l'utilisation et le partage de vos informations comme décrit dans notre Politique de Confidentialité.

# termsSection7Title
source: 7. Intellectual Property
es: 7. Propiedad Intelectual
fr: 7. Propriété Intellectuelle

# termsSection7Content
source: SolidCV and its content are protected by intellectual property laws: • We retain all rights to our platform, design, and proprietary technology • You retain ownership of content you upload • You grant us a license to use your content to provide our services • You may not copy, modify, or redistribute our platform without permission
es: SolidCV y su contenido están protegidos por leyes de propiedad intelectual: • Retenemos todos los derechos a nuestra plataforma, diseño y tecnología propietaria • Retienes la propiedad del contenido que subas • Nos otorgas una licencia para usar tu contenido para proporcionar nuestros servicios • No puedes copiar, modificar o redistribuir nuestra plataforma sin permiso
fr: SolidCV et son contenu sont protégés par les lois sur la propriété intellectuelle : • Nous conservons tous les droits sur notre plateforme, conception et technologie propriétaire • Vous conservez la propriété du contenu que vous téléchargez • Vous nous accordez une licence d'utiliser votre contenu pour fournir nos services • Vous ne pouvez pas copier, modifier ou redistribuer notre plateforme sans autorisation

# termsSection8Title
source: 8. AI-Powered Features
es: 8. Características Impulsadas por IA
fr: 8. Fonctionnalités Alimentées par l'IA

# termsSection8Content
source: Our platform includes AI-powered career guidance and feedback: • AI recommendations are for informational purposes only • We do not guarantee the accuracy of AI-generated content • AI features may use your data to improve our services • You should not rely solely on AI recommendations for career decisions
es: Nuestra plataforma incluye orientación profesional y retroalimentación impulsada por IA: • Las recomendaciones de IA son solo para fines informativos • No garantizamos la precisión del contenido generado por IA • Las características de IA pueden usar tus datos para mejorar nuestros servicios • No debes depender únicamente de las recomendaciones de IA para decisiones profesionales
fr: Notre plateforme inclut des conseils de carrière et des commentaires alimentés par l'IA : • Les recommandations IA sont à des fins informatives uniquement • Nous ne garantissons pas la précision du contenu généré par l'IA • Les fonctionnalités IA peuvent utiliser vos données pour améliorer nos services • Vous ne devriez pas vous fier uniquement aux recommandations IA pour les décisions de carrière

# termsSection9Title
source: 9. Payment and Subscription Terms
es: 9. Términos de Pago y Suscripción
fr: 9. Conditions de Paiement et d'Abonnement

# termsSection9Content
source: If applicable to premium features: • Subscription fees are charged in advance • Refunds are subject to our refund policy • We may change pricing with 30 days' notice • You are responsible for all taxes and fees • Payment information must be accurate and current
es: Si es aplicable a características premium: • Las tarifas de suscripción se cobran por adelantado • Los reembolsos están sujetos a nuestra política de reembolsos • Podemos cambiar los precios con 30 días de aviso • Eres responsable de todos los impuestos y tarifas • La información de pago debe ser precisa y actual
fr: Si applicable aux fonctionnalités premium : • Les frais d'abonnement sont facturés à l'avance • Les remboursements sont soumis à notre politique de remboursement • Nous pouvons changer les tarifs avec un préavis de 30 jours • Vous êtes responsable de tous les impôts et frais • Les informations de paiement doivent être précises et à jour

# termsSection10Title
source: 10. Limitation of Liability
es: 10. Limitación de Responsabilidad
fr: 10. Limitation de Responsabilité

# termsSection10Content
source: TO THE MAXIMUM EXTENT PERMITTED BY LAW: • SolidCV is provided 'as is' without warranties • We are not liable for indirect, incidental, or consequential damages • Our total liability is limited to the amount you paid us in the past 12 months • We are not responsible for blockchain network issues or third-party services
es: EN LA MÁXIMA MEDIDA PERMITIDA POR LA LEY: • SolidCV se proporciona 'tal como está' sin garantías • No somos responsables por daños indirectos, incidentales o consecuentes • Nuestra responsabilidad total se limita a la cantidad que nos pagaste en los últimos 12 meses • No somos responsables por problemas de la red blockchain o servicios de terceros
fr: DANS LA MESURE MAXIMALE PERMISE PAR LA LOI : • SolidCV est fourni 'tel quel' sans garanties • Nous ne sommes pas responsables des dommages indirects, accessoires ou consécutifs • Notre responsabilité totale est limitée au montant que vous nous avez payé au cours des 12 derniers mois • Nous ne sommes pas responsables des problèmes de réseau blockchain ou des services tiers

# termsSection11Title
source: 11. Termination
es: 11. Terminación
fr: 11. Résiliation
