Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# certificateGradeRequired
source: Please enter a grade
es: Por favor ingrese una calificación
fr: Veuillez saisir une note

# certificateCurriculum
source: Curriculum
es: Plan de Estudios
fr: Programme d'Études

# certificateCurriculumRequired
source: Please enter a curriculum
es: Por favor ingrese un plan de estudios
fr: Veuillez saisir un programme d'études

# certificateDescriptionRequired
source: Please enter a description
es: Por favor ingrese una descripción
fr: Veuillez saisir une description

source: Publication Date
es: Fecha de Publicación
fr: Date de Publication

# publicationDateRequired
source: Please pick a publication date
es: Por favor seleccione una fecha de publicación
fr: Veuillez sélectionner une date de publication

source: Wallet Password
es: Contraseña de Billetera
fr: Mot de Passe du Portefeuille

# selectFile
source: Select a file
es: Seleccionar un archivo
fr: Sélectionner un fichier

# addCertificateButton
source: + Add Certificate
es: + Agregar Certificado
fr: + Ajouter un Certificat

# manageJobOffersTitle
source: Manage Job Offers
es: Gestionar Ofertas de Trabajo
fr: Gérer les Offres d'Emploi

source: Share Job Offer
es: Compartir Oferta de Trabajo
fr: Partager l'Offre d'Emploi

# shareJobDescription
source: Share this job offer with potential candidates using the link below:
es: Comparte esta oferta de trabajo con candidatos potenciales usando el enlace a continuación:
fr: Partagez cette offre d'emploi avec des candidats potentiels en utilisant le lien ci-dessous :

source: Copy Link
es: Copiar Enlace
fr: Copier le Lien

# linkCopied
source: Link copied to clipboard!
es: ¡Enlace copiado al portapapeles!
fr: Lien copié dans le presse-papiers !

source: Delete Job Offer
es: Eliminar Oferta de Trabajo
fr: Supprimer l'Offre d'Emploi

# deleteJobConfirmation
source: Are you sure you want to delete this job offer? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta oferta de trabajo? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cette offre d'emploi ? Cette action ne peut pas être annulée.

# jobOfferDeleted
source: Job offer deleted successfully
es: Oferta de trabajo eliminada exitosamente
fr: Offre d'emploi supprimée avec succès

# deletionError
source: Error deleting job offer
es: Error al eliminar la oferta de trabajo
fr: Erreur lors de la suppression de l'offre d'emploi

# noJobOffersTitle
source: You haven't created any job offers yet
es: Aún no has creado ninguna oferta de trabajo
fr: Vous n'avez pas encore créé d'offres d'emploi

# noJobOffersSubtitle
source: Start attracting the best talent by creating your first job posting!
es: ¡Comienza a atraer el mejor talento creando tu primera publicación de trabajo!
fr: Commencez à attirer les meilleurs talents en créant votre première annonce d'emploi !

# createFirstJobTip
source: 💡 Tip: A well-written job description attracts quality candidates
es: 💡 Consejo: Una descripción de trabajo bien escrita atrae candidatos de calidad
fr: 💡 Conseil : Une description d'emploi bien rédigée attire des candidats de qualité

# detailedRequirementsTip
source: 📝 Include detailed requirements and company benefits
es: 📝 Incluye requisitos detallados y beneficios de la empresa
fr: 📝 Incluez des exigences détaillées et les avantages de l'entreprise

# responseTimeTip
source: ⚡ Quick response to applications improves your company image
es: ⚡ Respuesta rápida a las solicitudes mejora la imagen de tu empresa
fr: ⚡ Une réponse rapide aux candidatures améliore l'image de votre entreprise

source: Create Job Offer
es: Crear Oferta de Trabajo
fr: Créer une Offre d'Emploi

# jobOffersCount
source: {count, plural, =0{No job offers} =1{1 job offer} other{{count} job offers}}
es: {count, plural, =0{Sin ofertas de trabajo} =1{1 oferta de trabajo} other{{count} ofertas de trabajo}}
fr: {count, plural, =0{Aucune offre d'emploi} =1{1 offre d'emploi} other{{count} offres d'emploi}}

source: Active
es: Activa

source: Inactive
es: Inactiva

source: Share
es: Compartir
fr: Partager

source: Applications
es: Solicitudes
fr: Candidatures

# jobApplicationsTitle
source: Job Applications
es: Solicitudes de Trabajo
fr: Candidatures d'Emploi

# contactUser
source: Contact {firstName} {lastName}
es: Contactar a {firstName} {lastName}
fr: Contacter {firstName} {lastName}

source: Phone
es: Teléfono
fr: Téléphone

# applicationsLabel
source: Applications
es: Solicitudes
fr: Candidatures

# reviewCandidatesDescription
source: Review and manage candidates who applied for this position
es: Revisa y gestiona candidatos que han aplicado para esta posición
fr: Examinez et gérez les candidats qui ont postulé pour ce poste

# errorLoadingApplications
source: Error loading applications: {error}
es: Error cargando solicitudes: {error}
fr: Erreur lors du chargement des candidatures : {error}

source: No applications yet
es: Aún no hay solicitudes
fr: Aucune candidature pour le moment

# applicationsWillAppear
source: Applications will appear here when users apply
es: Las solicitudes aparecerán aquí cuando los usuarios apliquen
fr: Les candidatures apparaîtront ici lorsque les utilisateurs postuleront

# applicantsCount
source: {count, plural, =0{No applicants} =1{1 Applicant} other{{count} Applicants}}
es: {count, plural, =0{Sin candidatos} =1{1 Candidato} other{{count} Candidatos}}
fr: {count, plural, =0{Aucun candidat} =1{1 Candidat} other{{count} Candidats}}

source: View Profile
es: Ver Perfil
fr: Voir le Profil

source: AI Analysis
es: Análisis IA
fr: Analyse IA

source: Unknown User
es: Usuario Desconocido
fr: Utilisateur Inconnu

# loadingText
source: Loading...
es: Cargando...
fr: Chargement...

# retryText
source: Retry
es: Reintentar
fr: Réessayer

# editJobOfferTitle
source: Edit Job Offer
es: Editar Oferta de Trabajo
fr: Modifier l'Offre d'Emploi

# deleteJobOfferTooltip
source: Delete Job Offer
es: Eliminar Oferta de Trabajo
fr: Supprimer l'Offre d'Emploi

# deleteJobOfferDialog
source: Delete Job Offer
es: Eliminar Oferta de Trabajo
fr: Supprimer l'Offre d'Emploi

# deleteJobOfferConfirmation
source: Are you sure you want to delete this job offer? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta oferta de trabajo? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cette offre d'emploi ? Cette action ne peut pas être annulée.

# jobOfferUpdatedSuccess
source: Job offer updated successfully!
es: ¡Oferta de trabajo actualizada exitosamente!
fr: Offre d'emploi mise à jour avec succès !

# errorUpdatingJobOffer
source: Error updating job offer: {error}
es: Error actualizando oferta de trabajo: {error}
fr: Erreur lors de la mise à jour de l'offre d'emploi : {error}

# jobOfferDeletedSuccess
source: Job offer deleted successfully
es: Oferta de trabajo eliminada exitosamente
fr: Offre d'emploi supprimée avec succès

# errorDeletingJobOffer
source: Error deleting job offer: {error}
es: Error eliminando oferta de trabajo: {error}
fr: Erreur lors de la suppression de l'offre d'emploi : {error}

source: Job offer not found
es: Oferta de trabajo no encontrada
fr: Offre d'emploi introuvable

# locationHint
source: e.g. New York, NY or Remote
es: ej. Ciudad de México, CDMX o Remoto
fr: ex. Paris, France ou Télétravail

source: Job Type
es: Tipo de Trabajo
fr: Type d'Emploi

source: Salary (Optional)
es: Salario (Opcional)
fr: Salaire (Optionnel)

# salaryHint
source: e.g. $80,000 - $120,000 per year
es: ej. $80,000 - $120,000 por año
fr: ex. 80 000 € - 120 000 € par an

source: Requirements (Optional)
es: Requisitos (Opcional)
fr: Exigences (Optionnel)

# requirementsHint
source: List the skills, qualifications, and experience required...
es: Lista las habilidades, calificaciones y experiencia requerida...
fr: Listez les compétences, qualifications et expérience requises...

source: Benefits (Optional)
es: Beneficios (Opcional)
fr: Avantages (Optionnel)

# benefitsHint
source: Health insurance, flexible hours, remote work options...
es: Seguro médico, horarios flexibles, opciones de trabajo remoto...
fr: Assurance santé, horaires flexibles, options de télétravail...

source: Job Status
es: Estado del Trabajo
fr: Statut du Poste

# activeJobsVisible
source: Active jobs will be visible to job seekers
es: Los trabajos activos serán visibles para los buscadores de empleo
fr: Les postes actifs seront visibles pour les demandeurs d'emploi

source: Updating...
es: Actualizando...
fr: Mise à jour...

source: Update Job Offer
es: Actualizar Oferta de Trabajo
fr: Mettre à Jour l'Offre d'Emploi

# fieldRequired
source: {field} is required
es: {field} es requerido
fr: {field} est requis

# createJobOfferTitle
source: Create Job Offer
es: Crear Oferta de Trabajo
fr: Créer une Offre d'Emploi

# jobOfferCreatedSuccess
source: Job offer created successfully!
es: ¡Oferta de trabajo creada exitosamente!
fr: Offre d'emploi créée avec succès !

# errorCreatingJobOffer
source: Error creating job offer: {error}
es: Error al crear la oferta de trabajo: {error}
fr: Erreur lors de la création de l'offre d'emploi : {error}

source: Creating...
es: Creando...
fr: Création...

source: AI Candidate Analysis
es: Análisis IA del Candidato
fr: Analyse IA du Candidat

source: Generate New Feedback
es: Generar Nueva Retroalimentación
fr: Générer un Nouveau Feedback

# aiAnalysisGeneratedSuccess
source: AI analysis generated successfully!
es: ¡Análisis IA generado exitosamente!
fr: Analyse IA générée avec succès !

# errorGeneratingAnalysis
source: Error generating analysis: {error}
es: Error generando análisis: {error}
fr: Erreur lors de la génération de l'analyse : {error}

source: Not rated
es: Sin calificar
fr: Non évalué

source: Excellent fit
es: Excelente ajuste
fr: Parfait

source: Good fit
es: Buen ajuste
fr: Bon profil

source: Fair fit
es: Ajuste aceptable
fr: Profil acceptable

source: Poor fit
es: Ajuste deficiente
fr: Profil inadéquat

# contactCandidate
source: Contact {name}
es: Contactar a {name}
fr: Contacter {name}

# candidateContactInfo
source: Candidate Contact Information
es: Información de Contacto del Candidato
fr: Informations de Contact du Candidat

# phoneCopiedToClipboard
source: Phone number copied to clipboard
es: Número de teléfono copiado al portapapeles
fr: Numéro de téléphone copié dans le presse-papiers

# noContactInfoAvailable
source: No contact information available for this candidate.
es: No hay información de contacto disponible para este candidato.
fr: Aucune information de contact disponible pour ce candidat.

source: Job Position
es: Posición de Trabajo
fr: Poste de Travail

# aiAnalysisDescription
source: Comprehensive AI-powered analysis of candidate fit based on skills, experience, and job requirements
es: Análisis integral impulsado por IA del ajuste del candidato basado en habilidades, experiencia y requisitos del trabajo
fr: Analyse complète alimentée par l'IA de l'adéquation du candidat basée sur les compétences, l'expérience et les exigences du poste

# contactCandidateFull
source: Contact Candidate
es: Contactar Candidato
fr: Contacter le Candidat

source: Analyzing candidate profile...
es: Analizando perfil del candidato...
fr: Analyse du profil du candidat...

source: Regenerate AI Analysis
es: Regenerar Análisis IA
fr: Régénérer l'Analyse IA

source: Add or Update Experience
es: Añadir o Actualizar Experiencia
fr: Ajouter ou Mettre à Jour l'Expérience

# blockchainAddressError
source: This user does not have a valid Base Blockchain address.
es: Este usuario no tiene una dirección Base Blockchain válida.
fr: Cet utilisateur n'a pas d'adresse Base Blockchain valide.

# addOrUpdateExperienceFor
source: Add or Update Experience for "{name}"
es: Añadir o Actualizar Experiencia para "{name}"
fr: Ajouter ou Mettre à Jour l'Expérience pour "{name}"

source: ▶️ Create Work Experience
es: ▶️ Crear Experiencia Laboral
fr: ▶️ Créer l'Expérience Professionnelle

source: Role
es: Rol
fr: Rôle

source: Work experience created!
es: ¡Experiencia laboral creada!
fr: Expérience professionnelle créée !

source: End Experience
es: Finalizar Experiencia
fr: Terminer l'Expérience

source: Select Experience to End
es: Seleccionar Experiencia a Finalizar
fr: Sélectionner l'Expérience à Terminer

source: End
es: Finalizar
fr: Terminer

source: Experience ended!
es: ¡Experiencia finalizada!
fr: Expérience terminée !

source: Promote
es: Promover
fr: Promouvoir

source: Select Experience to Promote
es: Seleccionar Experiencia a Promover
fr: Sélectionner l'Expérience à Promouvoir

source: New Title
es: Nuevo Título
fr: Nouveau Titre

source: Employee promoted!
es: ¡Empleado promovido!
fr: Employé promu !

source: Title
es: Título
fr: Titre

source: Add an Employee
es: Añadir un Empleado
fr: Ajouter un Employé

# searchUserToAddAsEmployee
source: Search a user to add as employee
es: Buscar un usuario para añadir como empleado
fr: Rechercher un utilisateur à ajouter comme employé

# clickUserToAddToCompany
source: Click on a user to add to your company
es: Haz clic en un usuario para añadirlo a tu empresa
fr: Cliquez sur un utilisateur pour l'ajouter à votre entreprise

source: Career Advisor
es: Asesor de Carrera
fr: Conseiller de Carrière

source: Restart Process
es: Reiniciar Proceso
fr: Redémarrer le Processus

source: CV Check
es: Verificación de CV
fr: Vérification CV

source: Career Goals
es: Objetivos de Carrera
fr: Objectifs de Carrière

source: Skills Assessment
es: Evaluación de Habilidades
fr: Évaluation des Compétences

source: Industry Preferences
es: Preferencias de Industria
fr: Préférences d'Industrie

source: Your Career Advice
es: Tu Consejo de Carrera
fr: Vos Conseils de Carrière

source: Restart Career Advisor
es: Reiniciar Asesor de Carrera
fr: Redémarrer le Conseiller de Carrière

# restartConfirmationMessage
source: Are you sure you want to restart the process? All your progress will be lost.
es: ¿Estás seguro de que quieres reiniciar el proceso? Se perderá todo tu progreso.
fr: Êtes-vous sûr de vouloir redémarrer le processus ? Tous vos progrès seront perdus.

source: Restart
es: Reiniciar
fr: Redémarrer

# welcomeToAICareerAdvisor
source: Welcome to Your AI Career Advisor
es: Bienvenido a Tu Asesor de Carrera IA
fr: Bienvenue dans Votre Conseiller de Carrière IA

# careerJourneyDescription
source: I'm here to help you navigate your career journey. Based on your CV and preferences, I'll provide personalized advice to help you achieve your professional goals.
es: Estoy aquí para ayudarte a navegar tu trayectoria profesional. Basándome en tu CV y preferencias, te proporcionaré consejos personalizados para ayudarte a alcanzar tus objetivos profesionales.
fr: Je suis là pour vous aider à naviguer dans votre parcours professionnel. Basé sur votre CV et vos préférences, je fournirai des conseils personnalisés pour vous aider à atteindre vos objectifs professionnels.

source: What you'll get:
es: Lo que obtendrás:
fr: Ce que vous obtiendrez :

source: Personalized career recommendations
es: Recomendaciones de carrera personalizadas
fr: Recommandations de carrière personnalisées

# skillsGapAnalysis
source: Skills gap analysis and improvement tips
es: Análisis de brechas de habilidades y consejos de mejora
fr: Analyse des lacunes de compétences et conseils d'amélioration

# industryInsights
source: Industry insights and trends
es: Perspectivas e insights de la industria
fr: Perspectives et tendances de l'industrie

# nextStepsCareerGrowth
source: Next steps for your career growth
es: Próximos pasos para tu crecimiento profesional
fr: Prochaines étapes pour votre croissance professionnelle

source: Let's Get Started!
es: ¡Empecemos!
fr: Commençons !

# checkingCvStatus
source: Checking your CV status...
es: Verificando el estado de tu CV...
fr: Vérification du statut de votre CV...

source: Oops! Something went wrong
es: ¡Ups! Algo salió mal
fr: Oups ! Quelque chose s'est mal passé

# greatCvReady
source: Great! Your CV is ready
es: ¡Excelente! Tu CV está listo
fr: Parfait ! Votre CV est prêt

# cvFoundContinueAdvice
source: We found your completed CV. Let's continue with personalized career advice.
es: Encontramos tu CV completo. Continuemos con consejos de carrera personalizados.
fr: Nous avons trouvé votre CV complet. Continuons avec des conseils de carrière personnalisés.

# completeCvFirst
source: Complete Your CV First
es: Completa tu CV primero
fr: Complétez d'abord votre CV

# cvNeededForAdvice
source: To provide you with the best career advice, we need to analyze your CV first. Please complete your CV and then return to the career advisor.
es: Para brindarte los mejores consejos de carrera, necesitamos analizar tu CV primero. Por favor completa tu CV y luego regresa al asesor de carrera.
fr: Pour vous fournir les meilleurs conseils de carrière, nous devons d'abord analyser votre CV. Veuillez compléter votre CV puis revenir au conseiller de carrière.

source: Complete My CV
es: Completar mi CV
fr: Compléter mon CV

# completedCvCheckAgain
source: I've completed my CV - Check again
es: He completado mi CV - Verificar de nuevo
fr: J'ai complété mon CV - Vérifier à nouveau

source: Rate Your Skills
es: Evalúa tus Habilidades
fr: Évaluez vos Compétences

# skillsRatingDescription
source: Rate yourself from 1 (beginner) to 5 (expert) in each skill category.
es: Califícate del 1 (principiante) al 5 (experto) en cada categoría de habilidad.
fr: Évaluez-vous de 1 (débutant) à 5 (expert) dans chaque catégorie de compétence.

source: Leadership & Management
es: Liderazgo y Gestión
fr: Leadership et Management

source: Communication & Interpersonal
es: Comunicación e Interpersonal
fr: Communication et Relationnel

source: Technical & Digital
es: Técnico y Digital
fr: Technique et Numérique

source: Problem Solving & Analytics
es: Resolución de Problemas y Analítica
fr: Résolution de Problèmes et Analyse

source: Creativity & Innovation
es: Creatividad e Innovación
fr: Créativité et Innovation

source: Project Management
es: Gestión de Proyectos
fr: Gestion de Projet

source: Sales & Marketing
es: Ventas y Marketing
fr: Ventes et Marketing

source: Financial Management
es: Gestión Financiera
fr: Gestion Financière

source: Rate at least 3 skills
es: Califica al menos 3 habilidades
fr: Évaluez au moins 3 compétences

source: Industry & Work Preferences
es: Preferencias de Industria y Trabajo
fr: Préférences d'Industrie et de Travail

# selectIndustriesDescription
source: Select industries you're interested in and your work preferences.
es: Selecciona las industrias que te interesan y tus preferencias de trabajo.
fr: Sélectionnez les industries qui vous intéressent et vos préférences de travail.

# industriesOfInterest
source: Industries of Interest (Select up to 3)
es: Industrias de Interés (Selecciona hasta 3)
fr: Industries d'Intérêt (Sélectionnez jusqu'à 3)

source: Technology & Software
es: Tecnología y Software
fr: Technologie et Logiciels

source: Healthcare & Medicine
es: Salud y Medicina
fr: Santé et Médecine

source: Finance & Banking
es: Finanzas y Banca
fr: Finance et Banque

source: Education & Training
es: Educación y Formación
fr: Éducation et Formation

source: Marketing & Advertising
es: Marketing y Publicidad
fr: Marketing et Publicité

source: Consulting
es: Consultoría
fr: Conseil

source: Manufacturing
es: Manufactura
fr: Fabrication

source: Retail & E-commerce
es: Retail y Comercio Electrónico
fr: Vente au Détail et E-commerce

source: Media & Entertainment
es: Medios y Entretenimiento
fr: Médias et Divertissement

source: Non-profit & NGO
es: Sin Fines de Lucro y ONG
fr: Organisation à But Non Lucratif et ONG

source: Government & Public Sector
es: Gobierno y Sector Público
fr: Gouvernement et Secteur Public

source: Energy & Environment
es: Energía y Medio Ambiente
fr: Énergie et Environnement

source: Work Preferences
es: Preferencias de Trabajo
fr: Préférences de Travail

source: Work Location
es: Ubicación de Trabajo
fr: Lieu de Travail

source: Company Size
es: Tamaño de Empresa
fr: Taille d'Entreprise

source: Work Schedule
es: Horario de Trabajo
fr: Horaire de Travail

source: Remote
es: Remoto
fr: À distance

source: Hybrid
es: Híbrido
fr: Hybride

source: On-site
es: Presencial
fr: Sur site

source: No preference
es: Sin preferencia
fr: Aucune préférence

# medium51to500
source: Medium (51-500)
es: Mediana (51-500)
fr: Moyenne (51-500)

# large500plus
source: Large (500+)
es: Grande (500+)
fr: Grande (500+)

source: Freelance/Contract
es: Freelance/Contrato
fr: Freelance/Contrat

source: Generate Advice
es: Generar Consejos
fr: Générer des Conseils

source: What's your main career goal?
es: ¿Cuál es tu objetivo principal de carrera?
fr: Quel est votre objectif principal de carrière ?

# selectPrimaryObjective
source: Select your primary objective so I can tailor advice to your needs.
es: Selecciona tu objetivo principal para que pueda adaptar los consejos a tus necesidades.
fr: Sélectionnez votre objectif principal pour que je puisse adapter les conseils à vos besoins.

# getPromotedCurrentRole
source: Get promoted in current role
es: Obtener una promoción en mi trabajo actual
fr: Obtenir une promotion dans mon poste actuel

# switchToNewIndustry
source: Switch to a new industry
es: Cambiar a una nueva industria
fr: Changer vers une nouvelle industrie

# findBetterWorkLifeBalance
source: Find a better work-life balance
es: Encontrar un mejor equilibrio trabajo-vida
fr: Trouver un meilleur équilibre travail-vie

source: Increase salary significantly
es: Aumentar significativamente el salario
fr: Augmenter significativement le salaire

source: Develop new skills
es: Desarrollar nuevas habilidades
fr: Développer de nouvelles compétences

source: Start my own business
es: Iniciar mi propio negocio
fr: Créer ma propre entreprise

source: Find remote work opportunities
es: Encontrar oportunidades de trabajo remoto
fr: Trouver des opportunités de travail à distance

source: Other
es: Otro
fr: Autre

source: Describe your career goal
es: Describe tu objetivo de carrera
fr: Décrivez votre objectif de carrière

# careerGoalHintText
source: e.g., Transition into product management, become a data scientist, start a consulting practice...
es: ej., Transición a gestión de productos, convertirme en científico de datos, iniciar una práctica de consultoría...
fr: ex., Transition vers la gestion de produits, devenir data scientist, créer un cabinet de conseil...

# beSpecificCareerGoal
source: Be specific about what you want to achieve in your career.
es: Sé específico sobre lo que quieres lograr en tu carrera.
fr: Soyez précis sur ce que vous voulez accomplir dans votre carrière.

source: Enter your goal above
es: Ingresa tu objetivo arriba
fr: Entrez votre objectif ci-dessus

source: Analyzing Your Profile...
es: Analizando Tu Perfil...
fr: Analyse de Votre Profil...

# aiCraftingAdvice
source: Our AI is crafting personalized career advice based on your responses and CV analysis.
es: Nuestra IA está creando consejos profesionales personalizados basados en tus respuestas y análisis de CV.
fr: Notre IA élabore des conseils de carrière personnalisés basés sur vos réponses et l'analyse de votre CV.

# thisMayTakeMoments
source: This may take a few moments...
es: Esto puede tomar unos momentos...
fr: Cela peut prendre quelques instants...

source: Connection Issue
es: Problema de Conexión
fr: Problème de Connexion

# backupSystemAdvice
source: We couldn't connect to our AI service, but we've generated advice based on your responses using our backup system.
es: No pudimos conectarnos a nuestro servicio de IA, pero hemos generado consejos basados en tus respuestas usando nuestro sistema de respaldo.
fr: Nous n'avons pas pu nous connecter à notre service IA, mais nous avons généré des conseils basés sur vos réponses en utilisant notre système de secours.
