Repository: sewelseb/solidcv_frontend
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# termsSection11Content
source: We may terminate or suspend your account at any time for: • Violation of these Terms • Fraudulent or illegal activity • Abuse of our services or other users • Non-payment of fees (if applicable) You may terminate your account at any time by contacting us. Upon termination, your right to use our services ceases immediately.
es: Podemos terminar o suspender tu cuenta en cualquier momento por: • Violación de estos Términos • Actividad fraudulenta o ilegal • Abuso de nuestros servicios u otros usuarios • Falta de pago de tarifas (si es aplicable) Puedes terminar tu cuenta en cualquier momento contactándonos. Al terminar, tu derecho a usar nuestros servicios cesa inmediatamente.
fr: Nous pouvons résilier ou suspendre votre compte à tout moment pour : • Violation de ces Conditions • Activité frauduleuse ou illégale • Abus de nos services ou d'autres utilisateurs • Non-paiement des frais (le cas échéant) Vous pouvez résilier votre compte à tout moment en nous contactant. Lors de la résiliation, votre droit d'utiliser nos services cesse immédiatement.

# termsSection12Title
source: 12. Changes to Terms
es: 12. Cambios a los Términos
fr: 12. Modifications des Conditions

# termsSection12Content
source: We reserve the right to modify these Terms at any time. We will notify you of significant changes via email or platform notification. Your continued use of our services after changes constitutes acceptance of the new Terms.
es: Nos reservamos el derecho de modificar estos Términos en cualquier momento. Te notificaremos de cambios significativos por correo electrónico o notificación de la plataforma. Tu uso continuado de nuestros servicios después de los cambios constituye aceptación de los nuevos Términos.
fr: Nous nous réservons le droit de modifier ces Conditions à tout moment. Nous vous informerons des changements significatifs par e-mail ou notification de plateforme. Votre utilisation continue de nos services après les changements constitue l'acceptation des nouvelles Conditions.

# termsSection13Title
source: 13. Governing Law and Disputes
es: 13. Ley Aplicable y Disputas
fr: 13. Droit Applicable et Litiges

# termsSection13Content
source: These Terms are governed by the laws of Ireland. Any disputes will be resolved through binding arbitration in accordance with the rules of [Arbitration Organization]. You waive your right to participate in class action lawsuits.
es: Estos Términos se rigen por las leyes de Irlanda. Cualquier disputa se resolverá a través de arbitraje vinculante de acuerdo con las reglas de [Organización de Arbitraje]. Renuncias a tu derecho de participar en demandas colectivas.
fr: Ces Conditions sont régies par les lois de l'Irlande. Tout litige sera résolu par arbitrage contraignant conformément aux règles de [Organisation d'Arbitrage]. Vous renoncez à votre droit de participer aux recours collectifs.

# termsSection14Title
source: 14. Contact Information
es: 14. Información de Contacto
fr: 14. Informations de Contact

# termsSection14Content
source: If you have questions about these Terms, please contact us at: Email: sebastien@solidcv.com For technical support: sebastien@solidcv.com
es: Si tienes preguntas sobre estos Términos, por favor contáctanos en: Correo electrónico: sebastien@solidcv.com Para soporte técnico: sebastien@solidcv.com
fr: Si vous avez des questions sur ces Conditions, veuillez nous contacter à : E-mail : sebastien@solidcv.com Pour le support technique : sebastien@solidcv.com

# passwordMinLength
source: Password must be at least 8 characters long
es: La contraseña debe tener al menos 8 caracteres
fr: Le mot de passe doit contenir au moins 8 caractères

# passwordNeedsCapital
source: Password must contain at least one capital letter
es: La contraseña debe contener al menos una letra mayúscula
fr: Le mot de passe doit contenir au moins une lettre majuscule

# passwordNeedsNumber
source: Password must contain at least one number
es: La contraseña debe contener al menos un número
fr: Le mot de passe doit contenir au moins un chiffre

# passwordNeedsSpecial
source: Password must contain at least one special character
es: La contraseña debe contener al menos un carácter especial
fr: Le mot de passe doit contenir au moins un caractère spécial

source: Password requirements:
es: Requisitos de contraseña:
fr: Exigences du mot de passe :

source: At least 8 characters
es: Al menos 8 caracteres
fr: Au moins 8 caractères

source: One capital letter
es: Una letra mayúscula
fr: Une lettre majuscule

source: One number
es: Un número
fr: Un chiffre

source: One special character
es: Un carácter especial
fr: Un caractère spécial

# pleaseFillAllFields
source: Please fill in all fields
es: Por favor completa todos los campos
fr: Veuillez remplir tous les champs

# pleaseAgreeToTerms
source: Please agree to the Terms and Conditions to continue
es: Por favor acepta los Términos y Condiciones para continuar
fr: Veuillez accepter les Conditions Générales pour continuer

source: Passwords do not match.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne correspondent pas.

source: Registering...
es: Registrando...
fr: Inscription en cours...

# registrationFailed
source: Registration failed: {error}
es: Registro fallido: {error}
fr: Échec de l'inscription : {error}

# createSolidCVAccount
source: Create a SolidCV Account
es: Crear una Cuenta de SolidCV
fr: Créer un Compte SolidCV

# signUpToManage
source: Sign up to manage your verified credentials.
es: Regístrate para gestionar tus credenciales verificadas.
fr: Inscrivez-vous pour gérer vos identifiants vérifiés.

source: Email address
es: Dirección de correo electrónico
fr: Adresse e-mail

# emailHint
source: example@domain.com
es: ejemplo@dominio.com
fr: exemple@domaine.com

source: Confirm password
es: Confirmar contraseña
fr: Confirmer le mot de passe

source: I agree to the
es: Acepto los
fr: J'accepte les

source: and
es: y
fr: et

source: Sign Up
es: Registrarse
fr: S'inscrire

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta?
fr: Vous avez déjà un compte ?

source: Sign in
es: Iniciar sesión
fr: Se connecter

source: All Locations
es: Todas las Ubicaciones
fr: Tous les Emplacements

source: All Types
es: Todos los Tipos
fr: Tous les Types

source: All Levels
es: Todos los Niveles
fr: Tous les Niveaux

source: Full-time
es: Tiempo completo
fr: Temps plein

source: Part-time
es: Tiempo parcial
fr: Temps partiel

source: Contract
es: Contrato
fr: Contrat

source: Internship
es: Prácticas
fr: Stage

source: Entry-level
es: Nivel inicial
fr: Niveau débutant

source: Mid-level
es: Nivel intermedio
fr: Niveau intermédiaire

source: Lead
es: Líder
fr: Chef d'équipe

source: Executive
es: Ejecutivo
fr: Exécutif

source: Unknown Company
es: Empresa Desconocida
fr: Entreprise Inconnue

source: Location not specified
es: Ubicación no especificada
fr: Emplacement non spécifié

# applyTo
source: Apply to {jobTitle}
es: Aplicar a {jobTitle}
fr: Postuler à {jobTitle}

source: Complete Profile
es: Completar Perfil
fr: Compléter le Profil

source: Test Skills
es: Probar Habilidades
fr: Tester les Compétences

source: Apply Now
es: Postularse Ahora
fr: Postuler Maintenant

source: Application submitted successfully!
es: ¡Aplicación enviada exitosamente!
fr: Candidature soumise avec succès !

# errorSubmittingApplication
source: Error submitting application: {error}
es: Error al enviar la aplicación: {error}
fr: Erreur lors de la soumission de candidature : {error}

# loginRequired
source: Please log in to apply for this job.
es: Por favor inicia sesión para postularte a este trabajo.
fr: Veuillez vous connecter pour postuler à ce poste.

# loginRequiredMessage
source: You need to be logged in to apply for jobs. Would you like to login or register?
es: Necesitas estar conectado para aplicar a trabajos. ¿Te gustaría iniciar sesión o registrarte?
fr: Vous devez être connecté pour postuler à des emplois. Souhaitez-vous vous connecter ou vous inscrire ?

# errorLoadingJobOffers
source: Error loading job offers: {error}
es: Error cargando ofertas de trabajo: {error}
fr: Erreur lors du chargement des offres d'emploi : {error}

source: See More
es: Ver Más
fr: Voir Plus

source: Maximize Your Chances!
es: ¡Maximiza Tus Oportunidades!
fr: Maximisez Vos Chances !

# beforeApplyingRecommend
source: Before applying, we recommend:
es: Antes de postularte, recomendamos:
fr: Avant de postuler, nous recommandons :

# completeProfilePersonalInfo
source: Complete your profile with personal information
es: Completa tu perfil con información personal
fr: Complétez votre profil avec des informations personnelles

# addWorkExperiences
source: Add your work experiences and achievements
es: Agrega tus experiencias laborales y logros
fr: Ajoutez vos expériences professionnelles et réalisations

# testShowcaseSkills
source: Test and showcase your skills with AI validation
es: Prueba y muestra tus habilidades con validación IA
fr: Testez et mettez en valeur vos compétences avec validation IA

# recruitersAnalyzeProfile
source: Recruiters will use AI to analyze your profile against this job!
es: ¡Los reclutadores usarán IA para analizar tu perfil contra este trabajo!
fr: Les recruteurs utiliseront l'IA pour analyser votre profil par rapport à cet emploi !

# readySubmitApplication
source: Are you ready to submit your application?
es: ¿Estás listo para enviar tu solicitud?
fr: Êtes-vous prêt à soumettre votre candidature ?

source: View Applications
es: Ver Solicitudes
fr: Voir les Candidatures

source: No job offers available
es: No hay ofertas de trabajo disponibles
fr: Aucune offre d'emploi disponible

# checkBackLaterOpportunities
source: Check back later for new opportunities
es: Vuelve más tarde para nuevas oportunidades
fr: Revenez plus tard pour de nouvelles opportunités

source: Job Opportunities
es: Oportunidades de Trabajo
fr: Opportunités d'Emploi

source: Find Your Dream Job
es: Encuentra Tu Trabajo Soñado
fr: Trouvez Votre Emploi de Rêve

# discoverOpportunitiesSkills
source: Discover opportunities that match your skills
es: Descubre oportunidades que coincidan con tus habilidades
fr: Découvrez des opportunités qui correspondent à vos compétences

source: Search jobs...
es: Buscar trabajos...
fr: Rechercher des emplois...

# noJobsMatchFilters
source: No jobs match your filters
es: Ningún trabajo coincide con tus filtros
fr: Aucun emploi ne correspond à vos filtres

# tryAdjustingSearchCriteria
source: Try adjusting your search criteria
es: Intenta ajustar tus criterios de búsqueda
fr: Essayez d'ajuster vos critères de recherche

source: Untitled Position
es: Posición Sin Título
fr: Poste Sans Titre

source: All
es: Todo
fr: Tout

source: Company not found
es: Empresa no encontrada
fr: Entreprise introuvable

# companyNotFoundOrError
source: Company not found or error loading company data
es: Empresa no encontrada o error al cargar datos de la empresa
fr: Entreprise introuvable ou erreur lors du chargement des données de l'entreprise

source: Company Profile
es: Perfil de Empresa
fr: Profil d'Entreprise

source: Go Back
es: Volver
fr: Retour

# unknownCompanyFallback
source: Unknown Company
es: Empresa Desconocida
fr: Entreprise Inconnue

source: Company Information
es: Información de la Empresa
fr: Informations de l'Entreprise

source: Active Jobs
es: Empleos Activos
fr: Emplois Actifs

source: Total Jobs
es: Total de Empleos
fr: Total des Emplois

source: Current Job Offers
es: Ofertas de Trabajo Actuales
fr: Offres d'Emploi Actuelles

# viewAllJobOffers
source: View All {count} Job Offers
es: Ver Todas las {count} Ofertas de Trabajo
fr: Voir Toutes les {count} Offres d'Emploi

# noJobOffersAvailableCompany
source: No Job Offers Available
es: No Hay Ofertas de Trabajo Disponibles
fr: Aucune Offre d'Emploi Disponible

# companyNoOpenPositions
source: This company currently has no open positions.
es: Esta empresa actualmente no tiene posiciones abiertas.
fr: Cette entreprise n'a actuellement aucune position ouverte.

source: View Full Profile
es: Ver Perfil Completo
fr: Voir le Profil Complet

source: Company Overview
es: Resumen de la Empresa
fr: Aperçu de l'Entreprise

source: Active Positions
es: Posiciones Activas
fr: Positions Actives

source: Total Job Offers
es: Total de Ofertas de Trabajo
fr: Total des Offres d'Emploi

source: Company Status
es: Estado de la Empresa
fr: Statut de l'Entreprise

source: Company Details
es: Detalles de la Empresa
fr: Détails de l'Entreprise

source: Full Address
es: Dirección Completa
fr: Adresse Complète

source: Blockchain Address
es: Dirección Blockchain
fr: Adresse Blockchain

source: Verification Status
es: Estado de Verificación
fr: Statut de Vérification

source: Verified Company
es: Empresa Verificada
fr: Entreprise Vérifiée

source: Standard Company
es: Empresa Estándar
fr: Entreprise Standard

source: SolidCV Privacy Policy
es: Política de Privacidad de SolidCV
fr: Politique de Confidentialité de SolidCV

# dataCollection
source: 1. Data Collection
es: 1. Recopilación de Datos
fr: 1. Collecte de Données

# dataCollectionText
source: We collect the data you provide (such as your name, email, CV details, education, and company information) to deliver and improve SolidCV services. We do not collect unnecessary personal data.
es: Recopilamos los datos que usted proporciona (como su nombre, correo electrónico, detalles del CV, educación e información de la empresa) para entregar y mejorar los servicios de SolidCV. No recopilamos datos personales innecesarios.
fr: Nous collectons les données que vous fournissez (telles que votre nom, e-mail, détails du CV, éducation et informations de l'entreprise) pour fournir et améliorer les services SolidCV. Nous ne collectons pas de données personnelles inutiles.

# dataUse
source: 2. Data Use
es: 2. Uso de Datos
fr: 2. Utilisation des Données

# dataUseText
source: Your data is only used to allow you to build, verify, and manage your CV, as well as interact with companies and educational institutions. We do not sell your information. Some features may use your data to improve the user experience or for statistical purposes (always anonymously).
es: Sus datos solo se utilizan para permitirle crear, verificar y gestionar su CV, así como interactuar con empresas e instituciones educativas. No vendemos su información. Algunas funciones pueden usar sus datos para mejorar la experiencia del usuario o para fines estadísticos (siempre de forma anónima).
fr: Vos données ne sont utilisées que pour vous permettre de créer, vérifier et gérer votre CV, ainsi que d'interagir avec les entreprises et institutions éducatives. Nous ne vendons pas vos informations. Certaines fonctionnalités peuvent utiliser vos données pour améliorer l'expérience utilisateur ou à des fins statistiques (toujours de manière anonyme).

# dataSharing
source: 3. Data Sharing
es: 3. Compartir Datos
fr: 3. Partage de Données

# dataSharingText
source: We do not share your personal data with third parties except when required by law, or with your explicit consent (for example, when you request to verify your CV with a company or educational institution).
es: No compartimos sus datos personales con terceros excepto cuando lo requiera la ley, o con su consentimiento explícito (por ejemplo, cuando solicita verificar su CV con una empresa o institución educativa).
fr: Nous ne partageons pas vos données personnelles avec des tiers sauf lorsque requis par la loi, ou avec votre consentement explicite (par exemple, lorsque vous demandez à vérifier votre CV avec une entreprise ou institution éducative).

# dataSecurity
source: 4. Data Security
es: 4. Seguridad de Datos
fr: 4. Sécurité des Données

# dataSecurityText
source: Your data is encrypted and securely stored. Sensitive data (such as private keys) are never stored on our servers but remain on your device only. Always keep your credentials safe.
es: Sus datos están encriptados y almacenados de forma segura. Los datos sensibles (como las claves privadas) nunca se almacenan en nuestros servidores sino que permanecen solo en su dispositivo. Mantenga siempre sus credenciales seguras.
fr: Vos données sont chiffrées et stockées en toute sécurité. Les données sensibles (telles que les clés privées) ne sont jamais stockées sur nos serveurs mais restent uniquement sur votre appareil. Gardez toujours vos identifiants en sécurité.

# userRights
source: 5. User Rights
es: 5. Derechos del Usuario
fr: 5. Droits de l'Utilisateur

# userRightsText
source: You can access, modify, or delete your personal data at any time via the application. To request data deletion, contact us at privacy@solidcv.app.
es: Puede acceder, modificar o eliminar sus datos personales en cualquier momento a través de la aplicación. Para solicitar la eliminación de datos, contáctenos en privacy@solidcv.app.
fr: Vous pouvez accéder, modifier ou supprimer vos données personnelles à tout moment via l'application. Pour demander la suppression des données, contactez-nous à privacy@solidcv.app.

# cookiesAnalytics
source: 6. Cookies & Analytics
es: 6. Cookies y Analíticas
fr: 6. Cookies et Analytiques

# cookiesAnalyticsText
source: We use essential cookies and analytics only to improve the app. No tracking for advertising purposes is done.
es: Utilizamos solo cookies esenciales y analíticas para mejorar la aplicación. No se realiza seguimiento con fines publicitarios.
fr: Nous utilisons uniquement des cookies essentiels et des analytiques pour améliorer l'application. Aucun suivi à des fins publicitaires n'est effectué.

source: Contact
es: Contactar
fr: Contacter

# contactText
source: If you have any question about your privacy, contact us at sebastien@solidcv.com.
es: Si tiene alguna pregunta sobre su privacidad, contáctenos en sebastien@solidcv.com.
fr: Si vous avez des questions concernant votre confidentialité, contactez-nous à sebastien.debeauffort@outlook.com.

source: My Organisations
es: Mis Organizaciones
fr: Mes Organisations

source: My Companies
es: Mis Empresas
fr: Mes Entreprises

source: My Education Institutions
es: Mis Instituciones Educativas
fr: Mes Établissements d'Enseignement

source: Add Company
es: Agregar Empresa
fr: Ajouter une Entreprise

source: Add Education Institution
es: Agregar Institución Educativa
fr: Ajouter une Institution Éducative

source: Education Institution Administration
es: Administración de Institución Educativa
fr: Administration d'Établissement d'Enseignement

source: Education Institution updated!
es: ¡Institución Educativa actualizada!
fr: Établissement d'Enseignement mis à jour !

source: No data available
es: No hay datos disponibles
fr: Aucune donnée disponible

# changeInstitutionLogo
source: Change institution logo/image
es: Cambiar logo/imagen de la institución
fr: Changer le logo/image de l'établissement

source: Submitting...
es: Enviando...
fr: Envoi en cours...

source: Update Institution
es: Actualizar Institución
fr: Mettre à jour l'Établissement

source: Base Blockchain Wallet
es: Billetera Base Blockchain
fr: Portefeuille Base Blockchain

source: Base Blockchain Address
es: Dirección de Base Blockchain
fr: Adresse Base Blockchain

source: Base Blockchain Private key
es: Clave privada Base Blockchain
fr: Clé privée Base Blockchain

# blockchainWalletDescription
source: This is the Base Blockchain address that will be used to mint certificates or diplomas.\nWe don't store your private key on our server, it is stored on your device so make sure to keep it safe.
es: Esta es la dirección Base Blockchain que se utilizará para acuñar certificados o diplomas.\nNo almacenamos tu clave privada en nuestro servidor, se almacena en tu dispositivo, así que asegúrate de mantenerla segura.
fr: Ceci est l'adresse Base Blockchain qui sera utilisée pour créer des certificats ou diplômes.\nNous ne stockons pas votre clé privée sur notre serveur, elle est stockée sur votre appareil, alors assurez-vous de la garder en sécurité.

source: Password (encrypts private key)
es: Contraseña (encripta la clave privada)
fr: Mot de passe (chiffre la clé privée)

# passwordRecoveryWarning
source: This password will be used to encrypt your private key. Make sure to remember it. (There is no way to recover it)
es: Esta contraseña se utilizará para encriptar tu clave privada. Asegúrate de recordarla. (No hay forma de recuperarla)
fr: Ce mot de passe sera utilisé pour chiffrer votre clé privée. Assurez-vous de vous en souvenir. (Il n'y a aucun moyen de le récupérer)

source: Save Ethereum
es: Guardar Ethereum
fr: Sauvegarder Ethereum

source: Base Blockchain address saved!
es: ¡Dirección Base Blockchain guardada!
fr: Adresse Base Blockchain sauvegardée !

source: Trainees and Students
es: Aprendices y Estudiantes
fr: Stagiaires et Étudiants

# addBlockchainAddressFirst
source: Please add a Base Blockchain address before adding certificates.
es: Por favor agrega una dirección Base Blockchain antes de añadir certificados.
fr: Veuillez ajouter une adresse Base Blockchain avant d'ajouter des certificats.

source: + Add Certificates to User
es: + Agregar Certificados al Usuario
fr: + Ajouter des Certificats à l'Utilisateur

source: Institution Name
es: Nombre de la Institución
fr: Nom de l'Institution

source: Address number
es: Número de dirección
fr: Numéro d'adresse

source: Address street
es: Calle de dirección
fr: Rue d'adresse

source: City
es: Ciudad
fr: Ville

source: Zip code
es: Código postal
fr: Code postal

source: Country
es: País
fr: Pays

source: Invalid email
es: Correo electrónico inválido
fr: Email invalide

source: Company Administration
es: Administración de Empresa
fr: Administration d'Entreprise

source: Company updated!
es: ¡Empresa actualizada!
fr: Entreprise mise à jour !

# changeCompanyLogo
source: Change company logo/image
es: Cambiar logo/imagen de la empresa
fr: Changer le logo/image de l'entreprise

source: Update Company
es: Actualizar Empresa
fr: Mettre à jour l'Entreprise

source: Company Name
es: Nombre de la Empresa
fr: Nom de l'Entreprise

source: Job Offers
es: Ofertas de Trabajo
fr: Offres d'Emploi

source: Manage Job Offers
es: Gestionar Ofertas de Trabajo
fr: Gérer les Offres d'Emploi

source: Education Institution Administrators
es: Administradores de Institución Educativa

source: Company Administrators
es: Administradores de la Empresa
fr: Administrateurs de l'Entreprise

source: Remove Administrator
es: Eliminar Administrador
fr: Supprimer l'Administrateur

# removeAdministratorConfirmation
source: Are you sure you want to remove {name} as an administrator?
es: ¿Estás seguro de que quieres eliminar a {name} como administrador?
fr: Êtes-vous sûr de vouloir supprimer {name} en tant qu'administrateur ?

source: Remove
es: Eliminar
fr: Supprimer

# administratorRemoved
source: {name} removed as administrator
es: {name} eliminado como administrador
fr: {name} supprimé en tant qu'administrateur

# errorRemovingAdministrator
source: Error removing administrator: {error}
es: Error al eliminar administrador: {error}
fr: Erreur lors de la suppression de l'administrateur : {error}

# errorSearchingUsers
source: Error searching users: {error}
es: Error al buscar usuarios: {error}
fr: Erreur lors de la recherche d'utilisateurs : {error}

# errorLoadingAdministrators
source: Error loading administrators: {error}
es: Error al cargar administradores: {error}
fr: Erreur lors du chargement des administrateurs : {error}

# noAdministratorsFound
source: No administrators found. Add the first administrator below.
es: No se encontraron administradores. Agrega el primer administrador abajo.
fr: Aucun administrateur trouvé. Ajoutez le premier administrateur ci-dessous.

# currentAdministrators
source: Current Administrators ({count})
es: Administradores Actuales ({count})
fr: Administrateurs Actuels ({count})
